{"title":"F1 2026: uma Fórmula E com esteroides?","path":"/f1/f1-2026-uma-formula-e-com-esteroides/","site":"https://www.f1mania.net","atUri":"at://did:plc:4kqzy3sfm527lyag6fncyyzy/site.standard.document/3mesbvsiwzyn2","publishedAt":"2026-02-13T21:56:23Z","tags":"F1;Fernando Alonso;Fórmula 1;Max Verstappen;Mercedes;Red Bull;caption id=\"attachment_535921\" align=\"alignnone\" width=\"2000\"] Foto: XPB Images[/caption] **E é aí que está o centro da discussão** O antigo ERS, que já fazia parte da F1 desde 2014, sempre exigiu administração. Mas agora a eletrificação ganhou protagonismo absoluto. O piloto precisa regenerar muito mais energia por volta, controlar fases de aceleração e desaceleração com precisão quase matemática e utilizar os modos de ultrapassagem sabendo que a energia extra consumida precisará ser reposta no giro seguinte. O “lift and coast” — técnica de tirar o pé antes da frenagem para economizar e regenerar energia, passou a ser ferramenta quase constante. A ultrapassagem depende menos de ousadia e mais de cálculo energético. O botão de ataque virou um recurso estratégico que altera completamente o ritmo da volta seguinte. A pergunta que emerge após essa primeira semana não é sobre quem foi o mais rápido. É sobre que tipo de Fórmula 1 está nascendo. Ainda é cedo para conclusões definitivas. Toda mudança gera resistência, e os pilotos sempre foram naturalmente conservadores quando se trata da essência da pilotagem. Mas o fato de que múltiplos campeões e líderes do grid estejam vocalizando desconforto já indica que o impacto da nova era pode ser mais profundo do que se imaginava. Se confiabilidade e performance tendem a evoluir com o tempo, a sensação dos pilotos é algo mais difícil de recalibrar. E talvez o grande saldo desses três dias no Bahrein não esteja nos dados de telemetria, mas no sentimento claro de que, para muitos dentro do cockpit, a Fórmula 1 mudou e mudou muito. E não para melhor. [Leia mais: Antonelli bate Russell e termina com 1-2 da Mercedes no dia 3 no Bahrein"}