{"title":"26년 2월 3주차 그래프 오마카세","path":"/26-february-3week-graphomakase/","site":"https://www.graphusergroup.com","atUri":"at://did:plc:fzmvey4angj5gam2v44eikvz/site.standard.document/3meuq5i22vps2","publishedAt":"2026-02-15T04:46:42Z","tags":"RAG-Anything: All-in-One RAG FrameworkRetrieval-Augmented Generation (RAG) has emerged as a fundamental paradigm for expanding Large Language Models beyond their static training limitations. However, a critical misalignment exists between current RAG capabilities and real-world information environments. Modern knowledge repositories are inherently multimodal, containing rich combinations of textual content, visual elements, structured tables, and mathematical expressions. Yet existing RAG frameworks are limited to textual content, creating fundamental gaps when processing multimodal documents. We present RAG-Anything, a unified framework that enables comprehensive knowledge retrieval across all modalities. Our approach reconceptualizes multimodal content as interconnected knowledge entities rather than isolated data types. The framework introduces dual-graph construction to capture both cross-modal relationships and textual semantics within a unified representation. We develop cross-modal hybrid retrieval that combines structural knowledge navigation with semantic matching. This enables effective reasoning over heterogeneous content where relevant evidence spans multiple modalities. RAG-Anything demonstrates superior performance on challenging multimodal benchmarks, achieving significant improvements over state-of-the-art methods. Performance gains become particularly pronounced on long documents where traditional approaches fail. Our framework establishes a new paradigm for multimodal knowledge access, eliminating the architectural fragmentation that constrains current systems. Our framework is open-sourced at: https://github.com/HKUDS/RAG-Anything.arXiv.orgZirui Guo;GitHub - HKUDS/RAG-Anything: “RAG-Anything: All-in-One RAG Framework”“RAG-Anything: All-in-One RAG Framework”. Contribute to HKUDS/RAG-Anything development by creating an account on GitHub.GitHubHKUDS;LinkedIn;@jhbae1184"}