{"title":"Edinburgh Culture Minute 🪩 11 - 17 February 2026","path":"/edinburgh-culture-minute-11-17-february-2026/","site":"https://www.edinburghminute.com","atUri":"at://did:plc:2zkuzaydser36xy5ltq34xeb/site.standard.document/3melxzs6jw2f2","publishedAt":"2026-02-11T17:13:37Z","tags":"please get in touch;Jupiter Artland's spring/summer programme;A busy month of events at The Pitt;Kneecap announce Liquid Room gig;Line-up announced for Artists' Bookmarket at Fruitmarket;Artists stage a 'funeral for AI' at Stills gallery;Full details and some highlights are on the Fringe blog here;Chortle has a venue-by-venue summary;First 351 shows announced for Fringe 2026The first batch of shows to be staged at the 2026 Edinburgh Festival Fringe has been revealed. All shows are now available to browse and book.Ed Fringe;Enter the code FEELTHELOVE at checkout;Read more on the event's website here;The bar shared the news here;Kizzy Allott, Event Industry News;on its website here;More details and tickets here;Gutter Issue 33 Launch at The Portobello BookshopPlease come and join us for Gutter Issue 33 Launch on 17th February, at The Portobello Bookshop;Full details are here;Artists’ Bookmarket 2026 - FruitmarketA free, public space for culture in the heart of EdinburghFruitmarket;Tickets;Tickets go on sale on Friday;More line-up details here;Two Mr Ps in a Podcast: Live – Let That Be A Lesson…;SCO 25/26: Baroque Inspirations;THE CLASSIC ROCK SHOW 2026;Edinburgh City Orchestra: Dvořák's Cello Concerto and Mahler's 1st Symphony;SCO 25/26: Maxim and Friends;Kathryn Williams Mystery Park Tour;Randy Feltface – Gimmick;Lucy Rose;Alex O'Connor;RSNO Season 25-26: Love & Fairy Tales Rachmaninov & The Mermaid;The Ultimate Boy Band Party Show;Chinese New Year Celebration;Get Organised - Music From Nordic Countries;The Elvis Years;The George Michael Legacy;Talking Sopranos;Emerging Artists: Haver Quartet;Disney in Concert: The Sound of Magic;SCO: Benedetti plays Mendelssohn;Boyzlife;Chinese new Year CelebrationAs we welcome the Year of the Horse, we wish you all the very best of health, happiness, and success in the year ahead.Culture Edinburgh;More details;_All That Heaven Allows_;_Sing Street (on Sunday)_;**_I DON'T KNOW ANYTHING ABOUT ART, BUT I F*CKING LOVE THAT!_**;Boom Edinburgh;Good Egg Project newsletter;The Good Egg Project events and opportunities round-up 🐣 February 9-March 8Typewronger late night opening, and more creative news, plus events & open calls for writers and writingThe Good Egg Project newsletterThe Good Egg Project;Full details here;**★★★☆☆ Expansive**;**tickets**;**tickets**;**tickets**;**tickets**;UN]Lovable_** ([**tickets**;**tickets**), five short works-in-progress from Not So Nice!, while Tricky Hat have ** _The Flames_** , a devised piece from their over-50 company (Sat: [**tickets**;**★★★☆☆ Reflective**;**tickets**;**★★★★☆ Wholehearted**;**tickets**;**tickets**;**tickets**;**all linked here**;_Come by for a unique browsing experience!_;**_Gilded Saloon: Award-nominated comedian Robin Grainger_**;More details here;More details here;Work With Us – Independent Arts Projects (IAP);** _Great Escapes is Rowan Paton’s first major exhibition at The Scottish Gallery_**;Great Escapes | The Scottish GalleryThis February, we are delighted to present Great Escapes, Rowan Paton’s first major exhibition at The Gallery. Working across painting, collage, andScottish Gallery;** _The Torrance Gallery is delighted to announce that their current Alan Cameron Retrospective exhibition is extended_**;** _2 desks available in creative coworking studio in Edinburgh’s West End_**;sandstonecastles marketing;Co/Space Creative Co-Working Space Edinburgh • sandstonecastlesLooking for a relaxed space to work from? Co/Space is a small creative co-working space in Edinburgh for freelancers & small business owners!sandstonecastles;** _Breathe well. Sing well. Live well. workshops for women at The Salisbury Centre_**;** _The UNESCO Week of Sound in Edinburgh_**;UNESCO Week of Sound in Edinburgh;**_Leith Kino is back this Valentine’s weekend with Tod Browning’s pre-Code classic, Freaks_**;Leith Kino;**_Festival Theatre Edinburgh - Scottish Opera presents the world premiere of Dai Fujikura and Harry Ross's The Great Wave_**;The Great Wave | Scottish OperaJoin us for the world premiere of Dai Fujikura’s The Great Wave: an extravagant story about artist Katsushika Hokusai and his famous woodblock print The Great Wave off Kanagawa.Under 26 cheap tickets;_at the**Pianodrome** on February 21st_;**_Amid the ongoing war in Ukraine, three drag queens choose to stay_**;Scottish Documentary Institute;Subscribe now"}