{"title":"The Edinburgh Minute ⏰ Weekend edition: 13 - 15 February 2026","path":"/the-edinburgh-minute-weekend-edition-13-15-february-2026/","site":"https://www.edinburghminute.com","atUri":"at://did:plc:2zkuzaydser36xy5ltq34xeb/site.standard.document/3mepww7r3pz32","publishedAt":"2026-02-13T07:04:39Z","tags":"The full Met Office forecast is here;STV News has a text report by Local Democracy Reporter Joe Sullivan + a video report by Laura Alderman;reports BBC Scotland News;proposed last year;Evening News;Scotsman;published this press release;More details from the venue here;this;Craig Meighan, The Standard;Report by Amie Flett, STV News;Brian Ferguson in The Herald;Jane Bradley in The Scotsman;Duncan Cowles;More details from Ben Dalton in Screen Daily;Read more about it here;Here's a Calcutta Cup preview by Ben Banks in the Evening News;writes Kevin Millar of Scotland Rugby News;Rosaline Erskine in The Scotsman;by Kitty Messer in The Edinburgh Tab;Full train details here;**Buses here**;Travel with Lothian Buses to Scotland vs England – Guinness Men’s Six Nations 2026 - Lothian BusesLothian Buses will be standing by to take excited rugby fans to all the action on Saturday 14 February to see Scotland take on England!Lothian BusesKaren Keith;💌 News / event to share? Get in touch here;**Click this link**;Submit to The Edinburgh Minute | TownSpot - Hyperlocal Events CalendarWhat’s on in your town. TownSpot is the hyperlocal events calendar with an automated local newsletter.TownSpot;**_Applications are now open for Summerhall Arts Spaces_**;**Söderberg**;**_Booking is open for the University of Edinburgh’s short courses_**;CoursesShort courses at the University of EdinburghShort Courses;**_New Portobello pub The Rusty Seagull_**;**_This week at the Edinburgh Jazz 'n Jive its the Bill Jones Renaissance Swing Band_**;**_Buddhism: love, desire & relationships_**;**_Balerno Farmers Market returns_**;** _Mark Quinn returns to the Pianodrome for an all vinyl Valentines Day special listening session_**;Greenhouse Records;** _Ceilidh Collective host a Valentine’s Ceilidh at Portobello Town Hall_**;**Valentine Weekend Screenings at Out of the Blue in Leith**;** _Far Flung Trio will play at the Stockbridge Music Hub on Saturday_**;_via the website www.musichub.uk_;LUSH & Marpole Mini Afternoon RetreatA self valentine’s afternoon built around creativity, relaxation and good company. Painting, LUSH making, massage time and a sound bath.Eventbrite;** _This Saturday afternoon, Marpole Retreats is teaming up with LUSH for a cosy mini retreat at 378 Leith Walk_**;** _Edinburgh Iyengar Yoga Centre is inviting you to their Winter Warmer Active Yoga Class_**;** _Birchwood Art Studio on Saturday 14th February at 6pm for a Paint & Wine_**;** _Leith Kino is back this Valentine’s weekend with Tod Browning’s pre-Code classic, Freaks_**;Leith Kino;** _Postcards for Palestine: join us at Lighthouse Bookshop_**;Lighthouse | POSTCARDS FOR PALESTINE (2)POSTCARDS FOR PALESTINE (2);**_Ghosted, their interactive Valentine gameshow_**;** _Breathe well. Sing well. Live well. workshops for women at The Salisbury Centre_**;**_The Very Important Panel Show is coming to Edinburgh SUNDAY, 4pm at The Stand_**;Very Important Panel Show - The Stand Comedy ClubJoin comedian Kate Hammer as she tests four hilarious comedians on their general knowledge and ability to keep up as the show descends into glorious chaos. W…The Stand Comedy Club;**_CUPID MUST DIE! at Fountainbridge Library_**;** _The UNESCO Week of Sound in Edinburgh_**;**_Ten Men & Other Stories, by Edinburgh artist Robin Gillanders_**;Studies in Photography;**_Join our monthly EFT (Emotional Freedom Techniques) group sessions_**;**_new 6:30am mat Pilates class at Edinburgh Yoga Room_**;**_Free February half-term drop-in activities at the Physicians' Gallery_**;EventsHistory of medicine and school eventsRoyal College of Physicians of EdinburghRCPE;**_Listen to Tom Woods' fascinating talk about the bombing of Edinburgh and Leith_**;💌 News / event to share? Get in touch here;**_Gayle's Guide_**;Gayle’s Guide ✨ 12th Feb 26Issue 88 - Loads of stuff to do for the February holidays!Gayle's GuideGayle’s Guide;Subscribe now"}