{"title":"The Edinburgh Minute ⏰ Monday 16 February 2026","path":"/the-edinburgh-minute-monday-16-february-2026/","site":"https://www.edinburghminute.com","atUri":"at://did:plc:2zkuzaydser36xy5ltq34xeb/site.standard.document/3mexi7bukjbz2","publishedAt":"2026-02-16T07:02:29Z","tags":"please get in touch here;Subscribe for free or upgrade here;Met Office ice warning;Get the full week's Met Office forecast here;Alastair Dalton, The Scotsman;Laura Piper, STV News;by the 'Autonomous Library of Edinburgh;the Granton Station Facebook group;Network Rail has the details;Kevin Quinn, Evening News;Nicholas Malizia, Edinburgh Live;Edinburgh Live;Rightmove;**_Is Harry Potter tourism ruining Edinburgh?_** ' - James Walker, The National;_you’re welcome to submit yours here_;won the Scottish Street Food Awards;Gemma posted about appearing on Masterchef in this Instagram post;@planetgfood on Instagram;More details from Michelle Brown, of Love Your Business, here;For the last seven years, Love Your Business has had a yearly Charity Partner which receives 10% of every ticket you purchase for the networking events and workshops, including Make 2nds Count… | Michelle BrownFor the last seven years, Love Your Business has had a yearly Charity Partner which receives 10% of every ticket you purchase for the networking events and workshops, including Make 2nds Count, Support in Mind Scotland now Change Mental Health, Epilepsy Scotland, Invisible Cities, Fight Against Cancer Edinburgh, CARERS OF EAST LOTHIAN & SAMH. This year I’m delighted to announced we will be partnering with the Grassmarket Community Project which provides emotional and practical help for vulnerable people in the city, covering everything from drop-in support and befriending to employability and training guidance, and runs over 25 weekly free activities. These include music, crafts, swimming, gardening, meditation, woodwork and literacy classes. The aim is to enhance their life skills, develop confidence and increase their resilience, self-reliance and independence. They also have a community cinema, Coffee Saints café onsite in the Grassmarket and behind St James Quarter, a Tartan Shop with their very own tartan, and hire out event space, which is great for corporate events and weddings. I’ve known the Chief Executive Officer, Helene van der Ploeg, for a while and loved hearing all about the charity when she was a speaker at LYB last year, so it made perfect sense to support them this year. Tickets for the next Love Your Business event on Thursday, 26th February at Black Ivy in Bruntsfield, 11-1pm, are £20 with 10% of all sales going to out new charity partner, who will also receive PR/Marketing support throughout the year. Ticket link in first comment. Pics by 📸 Andrea Thomson.LinkedInMichelle Brown;‘**Maradona’ Finn Russell takes Murrayfield to place no Six Nations venue can match** ' - David Walsh in the Sunday Times;in the latest edition of Gayle's Guide;Gayle’s Guide ✨ 12th Feb 26Issue 88 - Loads of stuff to do for the February holidays!Gayle's GuideGayle’s Guide;Please get in touch using this form;More details here, shared by Catriona Bruce, Blast Running.;**_Edinburgh School Uniform Bank is recruiting for an Operations Assistant_**;**Rhyze Mushrooms Coop is hiring a Community Mushroom Farmer**;**We have organised a family led ride to the Botanics from our Porty Prom bike library for the February break on Thursday 18 Feb**;Winter Picnic Rides: To Edinburgh Botanic GardensJoin us for a safe, led ride from our bike library to these family-friendly gardens this winter.Eventbrite;**Studio Sollo: A new tech-led studio has opened in Fountainbridge, with an aim to make reformer Pilates more accessible**;Studio Sollo;**Summerhall Arts are looking for artists to take part in their 2026 Group Show Exhibition in April/May**;Summerhall Arts Group Show 2026 Callout - Summerhall ArtsIn light of the success of the first annual Summerhall Arts group show it is with great pleasure we can confirm that we are opening applications forSummerhall ArtsMatthew Norris;_**Rainer Maria Rilke: The Spiritual, Social, and Artistic Vision and Influence of His Life and Work**_;More details here, shared by Monty, Leith walk polisbox pop ups.;**5 week art courses starting in Feb**;Granton:HubGranton:Hub is a friendly arts and community hub in North Edinburgh where people can meet, participate, learn, create and enjoy a range of great activities. Our base is the beautiful and historic Madelvic House, a space that’s closely linked with Granton’s rich industrial heritage. We have a growing archive of materials and objects connected to the history of the local area; and are home to a community garden that’s open for all to visit and enjoy.Eventbrite;**_Mat Pilates Classes, at Cluny Hall, Morningside Parish Church_**;Pilates by Catrin;**Edinburgh’s finest improv show returns to Monkey Barrel Comedy tonight at 8pm!**;More details here, shared by Monty, Leith walk polisbox pop ups.;**Winter Feel-Good Movement Series at LifeCare, Fridays starting 20th February for 6 weeks**;Movement Remedies;Pilates for Pain Services in Stockbridge, Edinburgh — Movement RemediesSince Inception in 2022, Movement Remedies has been catering to the needs of anyone with persistent pain and/or a chronic condition with Pilates-based movement. Private, in-person sessions are available in the Stockbridge studio. Virtual Chair- and Mat-based classes are available virtually.Movement Remedies;**The Tailor presents the first Kitchen Takeover**;** _workshop that traces and treasures disabled and neurodivergent memory and experience_**;**_Pick a plant to grow this spring at the Houseplant and Seed Swap & Share_**;**A small, welcoming workshop in Leith for women navigating change in work, relationships, or identity**;Finding Your Feet Coaching;More details here, shared by Koren, Away with Willow.;** _launch of the brand new title from Catriona Ward \"Nowhere Burning\"_**;Argonaut Books;Argonaut Books - Leith’s Independent BookshopWe are Argonaut Books, a community bookshop for Leith, Edinburgh. We hold a curated selection of books; we only stock books that we are genuinely passionate about. We specialise in Science Fiction, Fantasy, Horror, Romance and Independent Publishing. We have been trading since December of 2021. We love being a part of Edinburgh’s vibrant literary ecosystem and we can’t wait to welcome you into the shop!Argonaut Books - Leith's Independent Bookshop;**_Birchwood Art Studio has spaces left on some of their spring term courses_**;More details here, shared by Jenn.;_Please share your local news and events here_;Booking is open for the University of Edinburgh’s short courses;Lost Shore Ratho bus trial becomes permanent public route;Hearts reveal Lunar New Year kit;20 of the best Edinburgh bars for watching rugby;Council's £90m tourist tax shopping list gets approved;Subscribe for free or upgrade here;tip jar;💚 Tip jar 💚"}