{"title":"The Edinburgh Minute ⏰ Wednesday 18 February 2026","path":"/the-edinburgh-minute-wednesday-18-february-2026/","site":"https://www.edinburghminute.com","atUri":"at://did:plc:2zkuzaydser36xy5ltq34xeb/site.standard.document/3mf4j5bbw4lp2","publishedAt":"2026-02-18T07:02:41Z","tags":"Subscribe for free or upgrade here;Joe Sullivan, Local Democracy Reporter, in Midlothian View;Rose Moncur, The Herald;gap site;Lee Dalgetty, Edinburgh Live;Exclusive by Brian Ferguson in The Herald;‘There is a bit of unfinished business’ - Ian Rankin on the return of John RebusA double birthday celebration is on the cards for fans of the celebrated detective.The HeraldBrian Ferguson;See the plans on Harry Williams' City Scope site here;report by Nicholas Malizia of Edinburgh Live;Maryse Bots and Lucy Frewin of Edinburgh Dot;EXCLUSIVE: University of Edinburgh purchased a car worth over £40K used by Peter MathiesonBy Maryse Bots and Lucy FrewinEdinburghDot’s SubstackEdinburghDot;Rose Moncur, The Herald;writes Environment Correspondent Vicky Allen, who joined the litter-pickers for a report in The Herald;Who should be responsible for clearing litter from our land?A new group is tackling the problem of rubbish in Edinburgh. I joined them for a pick at Seafield, where they are calling for the landowners to…The HeraldVicky Allan;**There's a new edition of Tenement Town by Diarmid Mogg**;21 East Crosscauseway21 East Crosscauseway, built around 1778—almost 250 years ago—on what is now a side street but was then the only paved road in the south of Edinburgh, which linked the city’s two main roads south. …Tenement TownTenement Town;Diarmid Mogg (@diarmidmogg.bsky.social);02/17/2026 09:49:00;Please get in touch using this form;NOSTALGIA;**_Doris Small: A Retrospective is a posthumous exhibition_**;Jane Strutt, Scran Academy;**Scottish Football and Political Behaviour Survey**;**Local maker crowdfunding a plastic recycling machine**;**Volunteer Drivers needed**;More details here.;More details here, shared by The Portobello Bookshop.;An Evening with George Saunders at Gordon Aikman Lecture TheatrePlease come and join us for An Evening with George Saunders on 19th February, at Gordon Aikman Lecture Theatre;More details here, shared by A Nice Day Out.;More details here, shared by Marpole Retreats.;More details here, shared by Georgian Concert Society.;Siglo de OroSoprano Sarah Keating; Mezzo-Soprano Rebekah Nießer-Jones Alto Lowri BuftonTenor Paul Bentley-Angell; Baritone Patrick AlliesBass Ben Rowarth Saturday 21 February 2026, 7.30pm, Edinburgh New Town C…The GEORGIAN CONCERT Society;More details here, shared by Ruth Appleby, Mud & Marsh Jewellery Design.;More details here, shared by Emma McCready.;More details here, shared by Susan Morrison, Stand Comedy Club.;Susan Morrison is Historically Funny - The Stand Comedy ClubWalking tours are great, but sometimes the weather isn’t.So come and join us in our cozy club on a comfy seat with a drink in your hand to take a sit-down no…The Stand Comedy Club;More details here, shared by Keith Paterson, Age Scotland.;More details here, shared by Volunteer Edinburgh.;Countdown to ‘Thrifty Thursday’ Fundraising Event - Volunteer Edinburgh📣Join us in 3 weeks - Thursday 26th Feb from 1.30pm until 5.30pm at our office on Leith Walk 4 hours of fashion at 4 pounds a pop and a fabulous afternoon of sustainable shopping from a selection of tremendous threads. All women’s and men’s items have been donated, and we are selling everything for £4 an item - making you four-ever stylish! Countdown to ‘Thrifty Thursday’ Fundraising Event eventsVolunteer EdinburghJason McCann;More details here, shared by Jonny5050.;_More info here_;_here_;_sign up here_;More details here, shared by Out of the Blue Arts and Education Trust.;**_Corstorphine Window Wanderland_**;Window Wanderland: Corstorphine Window Wanderland 202628 Feb‑2 Mar 2026: Corstorphine Window Wanderland is back for 2026!Once again we will brighten up the last weekend of February by transforming the streets of Corstorphine into a magical outdoor illuminated gallery for all to enjoy. Corstorphine Window Wanderland is a free event and everyone is invited to take part – residents, schools, community groups and businesses. We hope…Window Wanderland - Connecting people and communities, transforming streets into magical outdoor galleries;**_Book your slot at ESPC’s next event and speak to a solicitor about Powers of Attorney, Wills_**;**_Shaker Collective invites hospitality workers to its first Supper Club_**;More details here, shared by Todd Henkin.;Vinyl Club, 4th March 2026 7.30pm, S&G PortobelloAs we begin emerging from winter, buds are bursting and Belle and Sebastien are being talked about at Smith and Gertrude. Tigermilk, Belle and Sebastians debut album, went from obscure project to breakthrough indie album in the mid 90’s. At a time when confidence often meant volume, Tigermilk made space for fragility,Smith & GertrudeSmith & Gertrude;More details here, shared by Global Justice Now.;More details here, shared by Hannah, St Cecilia's Hall: Concert Room & Music Museum.;**_Eat with Ailsa is looking for a new Kitchen Assistant and a new Class Tutor for her Cooking Classes_**;_Please share your local news and events here_;Morrison Street pie shop changing its name;Details behind decision to pause George Street revamp;£4m for Leith Links revamp;Edinburgh Open Workshop: Make and Upholster Your Own Mid-Century Stool;Company Bakery February Pizza Party;Subscribe for free or upgrade here"}