{"title":"Yerinde gurbette olmak","path":"/yerinde-gurbette-olmak/","site":"https://www.fayn.press","atUri":"at://did:plc:k5suve3y7owkacozqoua4slj/site.standard.document/3me64rm7xncs2","publishedAt":"2026-02-06T05:01:27Z","tags":"6 Şubat’ın 3′üncü yıldönümü: Deprem davalarında kim korunuyor?6 Şubat depremlerinde on binlerce insan öldü. Milyonlarca insan evsiz kaldı. Müteahhitler serbest, kamu görevlileri kollanıyor, davalar sürüncemede. Eğer bu ölümler kader değilse, kayıpların siyasi ve hukuki sorumluları nerede?FaynFayn;Adıyaman: Enkaz altından çıkan bir beste, üç yıl sonra bir şehir6 Şubat’ta Adıyaman’da enkaz altında kalan Dicle, annesini ve kardeşini kaybetti. Belinde dokuz vida, yanında enkazdan çıkarılan piyanosu var. Onun hikayesi, Adıyaman’ın üçüncü yılında hâlâ süren toparlanma mücadelesiyle kesişiyor.FaynRabia Çetin;6 Şubat’ın 3. yılında Antakya: Yerinde gurbette olmakİnsanın büyüdüğü, yaşadığı, bildiği mekanın tanımsız ve yabancı bir hâl alması “yerinde gurbet” hâlini ifade eder. Orada olduğumuz hâlde, artık orada hissetmediğimiz bir gurbet hâli. İşte Antakyalılar, 6 Şubat’tan beri bunu yaşıyor çünkü şimdiki Antakya bildikleri Antakya değil.FaynTuğçe Tezer;Depreme çare: Yeni nesil komşuculukMarmara’da beklenen büyük depreme AFAD, BAK Kadıköy gibi kurumlar hazırlık yapıyor ama sanırım kaosun ve çaresizliğin asıl ilacı yeni nesil komşuculukta, yani mahallelerdeki gönüllü örgütlenmelerinde olabilir.FaynÇağla Öztek;Epstein dosyaları: Şeffaflık değil panik ürünüKüresel pedofil ağı kurucusu Epstein’ı kimse tanımıyor, adaya kimse gitmemiş. Ama dosyalarda Trump’tan Musk’a, Gates’ten saray dedikodularına herkes var. Türkiye’nin de adı geçiyor. Sansürlenen gerçeklerle, silinen notlarla ortaya çıkan şey şu: Bu dosyalar şeffaflık değil, panik ürünü.FaynElif Key;İran-ABD ilişkilerinin talihsiz tarihiABD ve İran birbirlerini şeytan ya da şer olarak nitelendirse de, en kanlı bıçaklı oldukları dönemde bile silah ticareti yapmaktan kaçınmadı. Gizli açık onlarca kez pazarlığa sahne olmuş ABD-İran ilişkilerinin talihsiz tarihini Sami Oğuz yazdı.FaynSami Oğuz;Subscribe now"}