{"title":"Banja Luka, Sarajevo, Široki Brijeg... Zbog čega neki Bosanci i Hercegovci javno mrze Hrvatsku - državu koja im je najprije spašavala živote i granice, a onda i ekonomiju?","path":"/banja-zbog-cega-neki-bosanci-i-hercegovci-mrze-hrvatsku-drzavu-koja-im-je-najprije-spasavala-zivote-i-granice-a-onda-i-ekonomiju/","site":"https://www.morski.hr","atUri":"at://did:plc:m3ltk5dwmad6gkrl5itmpdzm/site.standard.document/3mesusnzjkfl2","publishedAt":"2026-02-14T11:04:54Z","tags":"Bosanac i Hercegovac Stanivuković, gradonačelnik Banja Luke;**211,7 milijuna eura**;**10 milijuna eura**;VIDEO Gradonačelnik Banja Luke nakon kukanja za tzv. krajinom platio kaznu na granici s Hrvatskom i sad cmizdri jer ga granična policija pretražuje do detalja!Gradonačelnik Banje Luke Draško Stanivuković, koji je nedavno u Hrvatskoj kukao za tzv. krajinom i svojatao hrvatski teritorij, zadržan je na ulasku u Hrvatsku, gdje je nad njim obavljen temeljit policijski pregled. Stanivuković je u Hrvatsku pokušao ući preko graničnog prijelaza Gradiška. Hrvatski policajci ondje su ga detaljno pregledali, aMorski HRJurica Gašpar;Docent Muhasilović iz Sarajeva opleo po Hrvatskoj: “To je propala država, to nije ni država, to je resort”Prije otprilike mjesec dana priličnu je pozornost javnosti podigao tekst dr. Jahje Muhasilovića, docenta na Odsjeku za međunarodne odnose na Internacionalnom univerzitetu u Sarajevu, prenosi Jutarnji. U tekstu, objavljenom na portalu Stav.ba, Muhasilović donosi izrazito pesimističnu i kontroverznu analizu Hrvatske, prikazujući je kao geografski, politički i ekonomski neodrživ projekt.Morski HRJosip Tokić;KAKO JE NEUM POSTAO DIO BiH? Razlog za gradnju Pelješkog mosta star je 300 godina! | | Morski HRNEUM/KOMARNA - Povijest piše paradokse. Takva je i ona Dubrovačke Republike koja je cijenu svoje neutralnosti dobro naplatila. No kako ništa nije vječno, tako nije ni tad dobro rješenje koje će ihMorski HRJurica Gašpar;NEUM Izlazak na more susjeda - Između želja i stvarnostiDok nije izgrađen Pelješki most, Hrvati su uglavnom u Neum stizali iz dva razloga; 1. jer su morali, pošto je to bio jedini put koji je spajao jug s ostatkom Hrvatske i 2. jer je tamo pred dva desetljeća bilo kudikamo jeftinije kupovati. Oni treći su uglavnom ljudiMorski HRJurica Gašpar"}