{"title":"Müller (von) Thomamühl, Dagobert - Pomorski časnik i izumitelj i posljednji pripadnik austrougarske Ratne mornarice","path":"/muller-von-thomamuhl-dagobert-pomorski-casnik-i-izumitelj-i-posljednji-pripadnik-austrougarske-ratne-mornarice/","site":"https://www.morski.hr","atUri":"at://did:plc:m3ltk5dwmad6gkrl5itmpdzm/site.standard.document/3mevzqw64ejx2","publishedAt":"2026-02-15T17:11:25Z","tags":"Ludovik Salvator Austrijski – Nadvojvoda koji je kartirao JadranLudovik Salvator Austrijski (Erzherzog Ludwig Salvator, arciduca Luigi Salvatore), rođen 4. kolovoza 1847. u Firenci, bio je austrijski nadvojvoda, znanstvenik i istraživač Sredozemlja. Sin velikog vojvode Toskane Leopolda II., obrazovanje je stjecao u Pragu, gdje je proučavao filozofiju, pravo, prirodne znanosti i umjetnost. Najpoznatije djelo mu je “Atlas Dalmacije”, prviMorski HRJurica Gašpar;Antal Hajnal i Hilarion Pascal - Inženjeri zaslužni za gradnju riječke luke!U drugoj polovici 19. stoljeća, Rijeka pod upravom Mađarske postala je ključna luka za izvoz ugarskih proizvoda prema Mediteranu i svijetu. Moderni projekt luke, s planovima Hilariona Pascala (idejni projekt) i Antala Hajnala (voditelj gradnje i prilagodbe), uključivao je gradnju lukobrana, obala i gatova te nasipavanje velikih površinaMorski HRJurica Gašpar;ZNAČAJNI HRVATI U SVIJETU POMORSTVA Vjekoslav Škarica — Čovjek koji je oblikovao pomorsko pravo i uveo pojam “brodar”Kad se govori o pravnoj povijesti pomorstva u Hrvatskoj, ime Vjekoslav Škarica ostaje često nepoznato široj javnosti, ali duboko utisnuto u pravnu terminologiju i pomorsku pravnu kulturu. Tko je bio Vjekoslav Škarica? Vjekoslav Škarica (rođen 24. prosinca 1863. u Kaštel Starom, umro 13. siječnja 1945. u Splitu) bio je hrvatskiMorski HRJurica Gašpar;ZNAČAJNI HRVATI U SVIJETU POMORSTVA Nikola Primorac i njegova „Grad Ragusa“ - Hrvatski zapovjednik koji je osvojio AtlantikGodina je bila 1870., a mali dubrovački zapovjednik Nikola Primorac (rođen u Dubrovniku 27. srpnja 1840.) stajao je na pramcu jedrilice koja je nosila ime njegovog rodnog grada – Grad Ragusa. Premda malen i skroman, brod je bio izgrađen snažno, s dvostrukim podom, balastom od 1524 kg željeza, kondenzatorom za destilacijuMorski HRJurica Gašpar;ZNAČAJNI HRVATI U SVIJETU POMORSTVA Kapetan Božo Lovričević - Korčulanski pomorac, autor i pedagogBožo Lovričević, rođen 1908. godine u Korčuli, bio je jedan od istaknutih hrvatskih pomoraca i stručnjaka pomorske struke svoje generacije. Nakon završene nautičke škole 1926. godine, ukrcao se na brod, a 1930. položio je ispit kapetana duge plovidbe. Tijekom Drugog svjetskog rata plovio je na brodovima Neti, Ivan i Franka,Morski HRJurica Gašpar;ZNAČAJNI HRVATI U SVIJETU POMORSTVA Jozo Škarica – inženjer koji je oblikovao pomorsku baštinuJosip (Jozo) Škarica iz Rijeke bio je inženjer brodogradnje i jedan od najznačajnijih projektanata školskih brodova u regiji u prvoj polovici 20. stoljeća. Njegovo ime najpoznatije je povezano s projektom školskog broda „Jadran“, ali njegova uloga u razvoju pomorske tehnologije i brodogradnje nadilazi samo jedan brod – Škarica je simbol stručnosti,Morski HRJurica Gašpar"}