{"title":"Osam mjeseci nakon havarije, more i dalje izbacuje komade katamarana Melita na ovaj otočić kod Zadra","path":"/osam-mjeseci-nakon-havarije-more-i-dalje-izbacuje-komade-katamarana-melita-na-ovaj-otocic-kod-zadra/","site":"https://www.morski.hr","atUri":"at://did:plc:m3ltk5dwmad6gkrl5itmpdzm/site.standard.document/3mew2wk4j7ro2","publishedAt":"2026-02-15T17:32:19Z","tags":"**navečer, 16. lipnja 2025., u zadarskom kanalu ispred plaže Kolovare**;**spašavanje putnika i srećom u nesreći, baš svi su spašeni**;DOZNAJEMO Ovo su mogući razlozi havarije katamarana Melita - Struka i vlasnik se slažu: “Nekoliko stvari se podudara” - Zapovjednik: “Alarm se oglasio malo prije nego je pukao trup!”Kako je nastradala Melita, katamaran u vlasništvu tvrtke G&V Line Iadera, koji je doživio ozbiljnu havariju 16. lipnja 2025. godine tijekom plovidbe u zadarskom kanalu, nedaleko od Zadra, službeno će pokazati istraga, ali kockice se, neslužbeno doznajemo iz pouzdanih izvora, polako ali sigurno slažu. Incident se dogodio uslijed olujnogMorski HRJurica Gašpar;Zašto i kako je pukao trup katamarana? Inspektor: “Melita je dvostruko starija od ograničenja! Ovo je najveći problem na Jadranu”Putnički katamaran Melita u ponedjeljak navečer počeo je tonuti u Zadarskom kanalu. Na brodu je bilo 38 putnika i pet članova posade, u 21.40 Središnjica za traganje i spašavanje zaprimila je poziv za pomoć. Putnici pretpostavljaju da je brod oštećen uslijed udara u val tijekom nevremena. Brodica zadarske LučkeMorski HRJurica Gašpar;Mladi zapovjednik tonućeg broda ostao posljednji brojati jesu li svi evakuirani - Bilaver: “Predložit ću ga za sve moguće nagrade!”Dan nakon havarije katamarana Melita u kojoj pukim čudom nije nitko ozbiljnije nastradao (jedan član posade u padu je natukao leđa), a sve glave su na broju, razabiru se dojmovi. Na jutarnjim kavama po Zadru prepričavaju se i osobne priče putnika i posade, kao i ostalih spasitelja kojiMorski HRJurica Gašpar;VIDEO Melita je nakon havarije samljevena i odvezena na otpadŠIBENIK - Ovih je dana u šibenskom brodogradilištu Iskra u potpunosti demoliran katamaran Melita, tvrtke G&V line. Plastični katamaran, čiji je planirani vijek bio 20-ak godina, nakon čega su ga se Norvežani riješili, pa je prodan u Hrvatsku, gdje je putnike vozio još toliko, nastradao je pod još uvijekMorski HRJurica Gašpar;FOTO Pogledajte što je ostalo od katamarana! Melita dotegljena u šibensko brodogradilište - Brodar se obratio putnicima...ŠIBENIK/ZADAR - Brodar G&V Line Iadera u čijem vlasništvu je katamaran Melita koji je u ponedjeljak 16. lipnja, iz za sad još uvijek neutvrđenih razloga havariran, nakon čega su svi putnici uspješno evakuirani, obratio se putnicima, nakon što je spomenuti brod dotegljen u brodogradilište Iskra u Šibeniku. -Morski HRJurica Gašpar"}