{"title":"U Crnoj Gori izmjerene najviše razine mora od početka mjerenja!","path":"/u-crnoj-gori-izmjerene-najvise-razine-mora-od-pocetka-mjerenja/","site":"https://www.morski.hr","atUri":"at://did:plc:m3ltk5dwmad6gkrl5itmpdzm/site.standard.document/3mfbv2aphlwl2","publishedAt":"2026-02-20T10:19:06Z","tags":"Nova.rs;**ekstremne razine mora**;SUSTAV RANOG UPOZORAVANJA Hrvatski znanstvenici od sada mogu predvidjeti meteotsunamije!Meteotsunamiji ili šćige, nagle su i snažne oscilacije razine mora izazvane atmosferskim poremećajima, koje mogu uzrokovati snažne valove i poplaviti naseljene uvale. U radu objavljenom u znanstvenom časopisu Weather and Climate Extremes, istraživački tim predvođen dr. sc. Petrom Zemunik Selak s Instituta za oceanografiju i ribarstvo, predstavio je tzv. sinoptičkiMorski HRJosip Tokić;VIDEO Šibenski Dolac i cesta u Tribunju pod moremŠIBENIK - Dalmatinske rive ponovno su se našle pod morem zbog snažne ciklonalne plime i olujnog juga koji su tijekom dana zahvatili cijelu obalu. Osim u Kaštelima, Splitu, Trogiru i na Čiovu, kritično je opet i u šibenskom predjelu Dolac, gdje more opet ulazi u kuće. 0:00 /0:10Morski HRJurica Gašpar;Do kraja stoljeća more će se podići od pola do jednog metra - Austro-ugarska je mislila za svoje vrijeme, što mi čekamo?Jučerašnje poplave podsjetile su na ono što znanstvenici već godinama upozoravaju: razina mora raste, a naše obale nisu pripremljene. Pitanje je – hoćemo li djelovati prije nego bude kasno? Slike poplavljenih ulica, plovila, zgrada i obala od jučer i danas razišle su se društvenim mrežama. Ljudi prekoračuju improvizirana pješačka dna, vodaMorski HRJurica Gašpar;PRIČE IZ BLISKE BUDUĆNOSTI: “Potopljen Nin, sv. Donat sliči na otok-svjetionik, morske orgulje odavno utihnule, jer su pod morem”“Draga moja, ove godine nam je plima već treći puta plavila Poluotok i rivu sve tamo do Bedema, more je izlazilo iz kanalizacije i ulazilo u podrume kuća. Glavna riva sada je postao Muraj, Pozdrav Suncu ostao je kao atrakcija za ronioce-rekreativce, isto kao i stari rimski Forum i potopljeniMorski HRJurica Gašpar"}