{"title":"BRITANIJOM SE ŠIRI VIJEST Independent: \"Split zabranjuje prodaju alkohola noću!\"","path":"/britanijom-se-siri-vijest-independent-split-zabranjuje-prodaju-alkohola-nocu/","site":"https://www.morski.hr","atUri":"at://did:plc:m3ltk5dwmad6gkrl5itmpdzm/site.standard.document/3mfcqweoom5u2","publishedAt":"2026-02-20T18:37:56Z","tags":"**zabranu prodaje alkohola kasno noću**;**Independent**;Počelo je - hrpa pijanih Britanaca bauljala centrom Splita, jedan je urinirao ljudima pod prozorom!Turistička je sezona izgleda krenula nešto ranije što znamo po podacima Državnog zavoda za statistiku, ali i po pijanim gostima koji vrše nuždu ljudima pred nosom. Turistička sezona ove godine krenula je nešto ranije. Dovoljno je prošetati po centru grada i vidjet ćete brojne turiste kako razgledavaju Dioklecijanovu palaču. AktivniMorski HRJosip Tokić;VIDEO Snimio Britanca kako mokri ispred Kneževa dvora u Dubrovniku: “Kako te nije sram pišati tu?!?”Sramotnim prizorima prepunim nepoštivanja, često od strane britanskih turista, navikli smo se gledati po Splitu ili Hvaru gdje su donedavno najviše dolazili partijaneri, no čini se da se trend nepristojnosti nastavlja i u Dubrovniku, gradu poznatom po elitnom turizmu. U jednoj od dubrovačkih Facebook grupa objavljen je videoMorski HRJurica Gašpar;Pijani Britanci se mlatili u avionu na putu za Zadar!Jučer oko 11.50 sati policija je od službenika Zračne luke Zadar zaprimila dojavu da je u zrakoplovu na letu prema Zadru došlo do narušavanja javnog reda i mira. Nakon slijetanja zrakoplova na zračnu luku, policijski službenici Postaje pomorske i aerodromske policije Zadar su u prostorije policije doveli obojicu muškaracaMorski HRJosip Tokić;Zabrana pijančevanja i divljanja po Splitu odjeknula u Britaniji: “Splićani navode loše ponašanje britanskih turista”Vijest o zabrani pijančevanja u staroj gradskoj jezgri grada Splita i divljanja na javnim mjestima odjeknula je tamo, odakle i dolazi dobar dio onih koji se po Splitu i Dalmaciji ponašaju preopušteno i neodgovorno. - Hrvatski grad Split najnovije je europsko turističko odredište koje je odlučilo suzbiti problematičnoMorski HRJurica Gašpar;Zrakoplov prisilno sletio u Zadar jer je pijani Britanac nasrtao na stjuardesu!Jučer, 24. ožujka oko 18 sati policija je zaprimila dojavu službenika Zračne luke Zadar da je u Zračnu luku Zadar sletio zrakoplov na letu iz Londona za Sofiju. Naime, kapetan zrakoplova odlučio je prekinuti let i izvanredno sletjeti u Zadar, budući da je jedan od putnika narušavao javniMorski HRJurica Gašpar;Policajci na plaži pronašli golog Britanca: “Ne sjećam se ničega posljednja dva dana!”Pijani britanski turist pronađen je potpuno gol na tajlandskoj plaži nakon cjelonoćnog rođendanskog tulumarenja, rekavši policajcima da se ne sjeća prethodna dva dana. Muškarac iz Epsoma u Surreyu navodno je ostao piti pivo i pušiti marihuanu, koja je sada legalnu u Tajlandu, na proslavi svog 30. rođendana. Međutim, šokirani mještaniMorski HRJurica Gašpar"}