{"title":"Muhammad: The Torah’s Upholder & Defender","path":"/muhammad-the-torahs-upholder-defender/","site":"https://answeringislam.blog","atUri":"at://did:plc:gl3kczkbg2rbkbyxzofc7k32/site.standard.document/3mef5oofc3a52","publishedAt":"2026-02-09T00:06:24Z","tags":"http://m.qtafsir.com/Surah-Aal-e-Imran/Chastising-the-People-of-the-B---;https://www.altafsir.com/Tafasir.asp?tMadhNo=0&tTafsirNo=74&tSoraNo=3&tAyahNo=23&tDisplay=yes&UserProfile=0&LanguageId=2;3:23]. There is a difference of opinion about this verse’s occasion of revelation. Al-Suddi said: “When the Prophet called the Jews to embrace Islam, al-Nu‘man ibn Awfa said to him: ‘Come, O Muhammad, and let the rabbis judge between us’. **He said: ‘Let the Scripture of Allah be judge between us’**. They said: ‘No! Let the rabbis judge’. And so Allah, exalted is He, revealed this verse”. On the other hand, Sa‘id ibn Jubayr and ‘Ikrimah reported that Ibn ‘Abbas said: “The Messenger of Allah entered in on a group of Jews in a Jewish place of study and called them to Allah. Nu‘aym ibn ‘Amr and al-Harith ibn Zayd said to him: ‘O Muhammad, which religion are you on?’ He said: ‘The religion of Abraham’. They said: ‘But Abraham was a Jew’. The Messenger of Allah said: **‘In that case, let us go to the Torah and let it judge between us** ’. They refused. And Allah, exalted is He, revealed this verse”. Said al-Kalbi: “This was revealed about those who committed fornication in Khaybar and the Jews who asked the Prophet about the legal punishment of fornication”. The elaboration on this will come in Surah al-Ma’idah, Allah, exalted is He, willing”. ('Alī ibn Ahmad al-Wahidi, _Asbab al-Nuzul_ : [https://www.altafsir.com/Tafasir.asp?tMadhNo=0&tTafsirNo=86&tSoraNo=3&tAyahNo=23&tDisplay=yes&UserProfile=0&LanguageId=2;https://sunnah.com/abudawud:4449;**The Quran’s Confirmation of the Judeo-Christian Scriptures**;**Does the Quran confirm the Bible & the Canonical Gospels?**;**MORE QURANIC PROOF FOR THE TORAH’S PRESERVATION**;**The Greek Quran Confirms That Allah Revealed the Holy Bible**;**Does Taurat Refer Only to the Revelation Given to Moses?**"}