{"title":"\"THE MASKED PREDATORS' BALL: How Kubrick Filmed the Blueprint for Epstein's Empire Inside Their Actual Houses — and Now You Can Read His Inbox - Eyes Wide Shut - 19 February 2026","path":"/the-masked-predators-ball-how-kubrick-filmed-the-blueprint-for-epsteins-empire-inside-their-actual-houses-and-now-you-can-read-his-inbox-eyes-wide-shut-19-february-2026/","site":"https://www.themaorigreenlantern.maori.nz","atUri":"at://did:plc:xlhdb7otmtzrspsbaq7wzbac/site.standard.document/3mf63h4r2zr32","publishedAt":"2026-02-18T22:02:58Z","tags":"Jmail;over 3 million pages, 180,000 images, and 2,000 videos;Jmail.world;Riley Walz and Kino AI co-founder Luke Igel;Jmail has surpassed 450 million pageviews;built specifically to counter the DOJ's claim that searching the files is \"impractical due to technical limitations\";built Jmail in five hours;demolished that excuse overnight;Mashable reported;WIRED reported;jmail.world;Jmail's People tab;helicopter flights to Little Saint James;hundreds of friendly texts to Epstein;\"Is it possible to get your plane here to collect me?\";dine at Buckingham Palace;confidential UK trade envoy reports to Epstein within five minutes of receiving them;€500 billion EU bailout to Epstein hours before public announcement;confidential Chancellor-to-National Economic Council minutes within two minutes of receiving them;$75,000 in payments from Epstein;\"out to work on the streets\";searched his properties;\"sampling a fresh 100% female Russian at my yacht\";suspended by DP World's board;hacked emails reveal he tried to keep his security detail from accompanying him to Little Saint James;Peter Thiel, Israeli signals intelligence, and individuals in Putin's inner circle;\"Have you found me some new inappropriate friends?\";\"a legend\" and \"the brother I have always wished for\";\"Uncle Jeffrey\";resigned in February 2026;stepped down from OpenAI's board;150,000 times in the files;Jmail;Victor Ziegler is entirely Kubrick's invention;JMessage;sending girls listed by measurements, age (\"18 y old\"), weight, and departure city;\"sample a fresh 100% female Russian at my yacht\";JFlights;eight times during the 1990s;a 20-year-old woman whose name was redacted;JPhotos;photos appearing to show Andrew Mountbatten-Windsor kneeling over an unidentified woman lying on the floor;\"You can marry Princess Beatrice; the queen would have a queen as a grandson. Does that make it incest? How exciting.\";Drop Site News;an Israeli security agreement with Mongolia;inviting Ariane de Rothschild to dinner on his island;\"I think the craziest, most meta part is that you're reading his private emails of him trying to clean up his own reputation.\";\"at some point this will come — as long as [Trump] continues to top polls.\";Trump] continues to top polls.\" Epstein replied: [\"Would you like photos of Donald and girls in bikinis in my kitchen?\";Elveden Hall;approximately 32 to 40 times between 1998 and 2000;\"allegedly a close contact of Epstein\";\"minder\";Mentmore Towers, built for Baron Mayer de Rothschild;Ariane de Rothschild of the Rothschild banking group;sold his daughter's sexual services to these wealthy clients;JMessage;sending girls listed by measurements, age, weight, and departure city;\"sampling a fresh 100% female Russian\";borrowed Epstein's Palm Beach property;\"on my wife hunt\" but \"I prefer Scandinavians\";convicted of five charges including recruiting and trafficking four teenage girls;called Epstein \"Uncle Jeffrey\";resigned when it surfaced;Lesley Groff — Epstein's executive assistant — is mentioned 150,000 times in the files;1,000 documented victims;305 \"politically exposed persons\";Goldman Sachs' Ruemmler, DP World's bin Sulayem, UK Ambassador Mandelson, a Slovak politician;died by suicide in April 2025;Six Epstein survivors stated in September 2025;browsable on Jmail under \"Conspiring w/ Brunel\";Inspector General described as negligence and misconduct;accidentally published 43+ victims' full names and nude images;Thousands of documents were then removed;agreed to testify only under threat of criminal contempt of Congress;searched Mandelson's properties;following two older men from Ziegler's party;agreeing to give Helena to the cult;Jmail was built in five hours;\"new inappropriate friends\";\"beautiful 26-year-old Russian woman\";\"There's this built-in assumption that somehow there's this hidden tranche of information of men that we know about, that we're covering up. That is not the case.\";secretly recorded admitting officials would \"redact every Republican or conservative person in those files, leave all the liberal, Democratic people in those files\";Mentmore Towers (Rothschild);Elveden Hall (Guinness);Ariane de Rothschild appears in the files;hundreds of friendly texts with Epstein;\"Today's release marks the end of a very comprehensive document identification and review process.\";missed its Congressional deadline by six weeks;published victims' nude images while redacting perpetrators' names;Attorney General Bondi handed binders to social media influencers;\"sitting on my desk\";Jemini AI;broken Britain;resigned from Labour;properties searched;criminal investigation opened;strip his peerage;evicted from Royal Lodge;\"the brother I always wished for\";Drop Site News investigated;Peter Thiel and former Israeli signals intelligence officials;individuals in Putin's inner circle;\"security guys will NOT come with us to the island\";DOJ's 305-name \"politically exposed persons\" list;six Epstein survivors' request to be consulted;victims' nude images;3 million+ pages, 180,000 images, 2,000 videos, 305 named politically exposed persons;Jmail.world;450 million+ pageviews;Fast Company reported;jmail.world;Koha — Support The Māori Green Lantern;Subscribe to The Māori Green Lantern;RNZ;BBC;1News;PBS NewsHour;CNN;Al Jazeera;TIME;WIRED;Mashable;Fast Company;Drop Site News;Wikipedia;SAN;Jmail.world"}