{"title":"February 2026: Seeds of hope and abundance","path":"/february-2026-seeds-of-hope-and-abundance/","site":"https://news.transitionnetwork.org","atUri":"at://did:plc:kar7zozo3zvi4devrrdrghlx/site.standard.document/3mfbqthvm2g42","publishedAt":"2026-02-20T09:03:37Z","tags":"_Community Waves_;here;Day of Transition Practise 2026 Programme & RegistrationsJoin us in a very special day when Transitioners all around the world come together to share and learn from each other!Practising TransitionElizabeta Z Jovanovska;**SeedFunding**;Planting seeds for abundanceThe results from the Seed Funding campaign 2025-2026Transition NewsFilipa Pimentel;Seasonal Gatherings: Join a Year of Connection and CeremonyThu, March 19, 2026Seasonal Gatherings: Join a Year of Connection and Ceremony;**_Community Waves_**;Community Waves: the free, ethical, social media for changemakersReady to expand your ripple waves of connection and regeneration? We are thrilled to invite you to Community Waves, our alternative social media platform! Tired of big tech companies undermining our digital well-being, nasty algorithms, and persistent ads? So were we. That’s why we’ve been building this new, open-source platformTransition NewsEsther Molina;Transition as a Social TechnologyAfter nearly two decades deeply engaged in this field, the organizing model developed by the international Transition Towns Movement is still the most holistic, accessible, and effective social technology I’ve found for cultivating more resilient, equitable, sustainable, and regenerative local communities from the bottom up. Based on the experienceTransition NewsDon Hall;Voices from Abya YalaCompartiendo sabiduría desde la Sierra Nevada de Colombia: cuatro pueblos y una lección de ayer para el hoy. Caminando la visión de honrar a los Pueblos Originarios de todo el planeta, junto a las voces vivas hoy en el Sur Global, el l Círculo de Transformación Cultural da inicio conCultural Transformation CircleSebastian Pibi;EN] Do you like soup? If you are around Polmont early March, here is an event not to be missed! [Polmont SOUP;PT] Transition Brasil shares their journey to life-affirming economy: [A Jornada das Economias que afirmam a Vida;EN] [centreforlocalprosperity;centreforlocalprosperity invites you to a webinar to learn about Transition Towns! Thursday February 26th, 12-1pm ADT, info and registration [here;EN] Transition Together's Youth Circle are bringing their short film, **‘In the Making’** to Totnes. This evening of intergenerational connection, community building and youth power [will take place;Here’s how you can take part;We Are The ReGeneration;The Future We Want;**here**;How-to instructions here;Add your Transition events and activities to the calendar;_Re-Imagining Education Conference_;https://kindness.org/;Imagine 2050: What will our story be?;Restoring Your Ecological Awareness;Youth Climate Justice Fund;**Community Waves**;Facebook;Instagram;Bluesky;LinkedIn;YouTube;subscribe yourself here;**donate**"}