{"title":"VENEZUELA SILVER OPERATION: US Denies China Access to Critical Resources","path":"/venezuela-silver-operation-us-denies-china-access-to-critical-resources/","site":"https://www.silverwars.com","atUri":"at://did:plc:rc4h6r7sx5zvoio3aou5i76y/site.standard.document/3mengsyzorod2","publishedAt":"2026-01-12T19:15:15Z","tags":"In practice;Venezuela Hires Rothschild as Adviser on Defaulted Debt PileVenezuela’s government has hired Rothschild & Co. as a financial adviser to provide an overview of its foreign debt obligations, according to people familiar with the matter.BloombergNicolle Yapur;Venezuela files legal claim with Bank of England over goldThe Central Bank of Venezuela says the gold’s value could be used to tackle coronavirus.BBC NewsBBC News;Venezuelan Smugglers Had $5M in Gold at Fort Lauderdale Airport: FedsTwo Venezuelan nationals were arrested at a South Florida airport after authorities say the small plane they were in was carrying $5 million in gold bars.NBC 6 South Florida;2019-2025-Mining-Sectorial-PlanVenezuelan Mining Sector Plans2019-2025-Mining-Sectorial-Plan.pdf9 MBdownload-circle;USGS 2017-2018 VENEZUELA Mineral YearbookUSGS 2017-2018 VENEZUELA Mineral Yearbook.pdf303 KBdownload-circle;[ OPEN PROCUREMENT BRIEF ];Pressure;China’s $100 Billion Gamble On Venezuela In Jeopardy: Is Beijing The “Biggest Loser” Of U.S. Military Ops On Maduro?It was a match made in heaven. In the first decade of the 21st century, as China’s economy grew at an unprecedented rate, it had an ever-growing need for energy to power its industries. Meanwhile, Venezuela, flush with oil resources, needed hard cash as it tried to diversify its economy away from its dependence on […]EURASIAN TIMESSumit Ahlawat;…]EURASIAN TIMESSumit Ahlawat[China’s Critical Mineral Model in Latin AmericaThe great power competition underway between the United States and China has a ripple effect in each nation’s neighborhood. As the United States prepares for possible conflict seven thousand [...]New Security BeatGregory Wischer;China’s Critical Mineral Model in Latin AmericaThe great power competition underway between the United States and China has a ripple effect in each nation’s neighborhood. As the United States prepares for possible conflict seven thousand [...]New Security BeatGregory Wischer[The Critical Minerals Trade: The Illegal Route Connecting the Amazon with ChinaA complex network of actors has emerged around the critical minerals of the Amazon. Some operate along contested river corridors, trading with guerrilla groups and corrupt security forces. Others, under a façade of legality, move massive quantities of material through large port cities connected to international trade routes. Together, these operations endanger the environment and the sovereignty of entire nations.InfoAmazoniaBram Ebus;...]New Security BeatGregory Wischer[The Critical Minerals Trade: The Illegal Route Connecting the Amazon with ChinaA complex network of actors has emerged around the critical minerals of the Amazon. Some operate along contested river corridors, trading with guerrilla groups and corrupt security forces. Others, under a façade of legality, move massive quantities of material through large port cities connected to international trade routes. Together, these operations endanger the environment and the sovereignty of entire nations.InfoAmazoniaBram Ebus[China’s Growing Influence in Latin AmericaFor more than two decades, China has developed close economic and security ties with many Latin American countries, including Brazil, Peru, and Venezuela. But Beijing’s increasing sway in the region …Council on Foreign RelationsDiana Roy;The Silent War for Control Over Strategic Silver ResourcesTo maintain supply of a finite resource, it would not be in any superpower’s interest to disclose how critical silver is to maintain its military power or its dependence on any one material for any reason. Except, its safe to say that silver is a problem shared…SilverWarsIA;financial adviser;⚠ DECLASSIFY CLICK TO ACCESS INTELLIGENCE;SRC-01 ↗;SRC-02 ↗;SRC-03 ↗;Wilbur Ross;Rothschild Inc.;SRC-04 ↗;SRC-05 ↗;SRC-01 ↗;Chinas Energy Empire in Africa and Its Threats to US National SecurityChinas Energy Empire in Africa and Its Threats to US National Security.pdf566 KBdownload-circle;Afghanistans Oil - Gas - and Minerals Industries - Jan 2016Afghanistans Oil - Gas - and Minerals Industries - Jan 2016.pdf2 MBdownload-circle;Milos Alcalay - WikipediaWikimedia Foundation, Inc.Contributors to Wikimedia projects;The Illegal Gold in Your Phone Is Slowly Poisoning the AmazonOn its way from mine to market, illegally-extracted gold is trafficked from Venezuela through Guyana and is bypassing U.S sanctions.VICEWes Michael Tomaselli;@NatRothschild1;@TPV_John;@NatRothschild1;@NatRothschild1"}