{"title":"Rockton-Roscoe News: Saturday, Feb. 7, 2026","path":"/rockton-roscoe-news-friday-jan-30-2026-2/","site":"https://roscoenews.com","atUri":"at://did:plc:kn5uqmuxdixjyasof6vmn7na/site.standard.document/3mebeo42cjpv2","publishedAt":"2026-02-07T12:00:43Z","tags":"Rockton;Roscoe;South Beloit;_Rockton-Roscoe News_;Big 4th quarter propels SOBOs past Hiawatha 66-52.The win represents more than just another mark in the conference standings.Rockton-Roscoe NewsHarold Bone;Hononegah Indians beat Harlem 62-48 off a second-half scoring burst.The second half saw Hononegah really come into their own offensively with senior guard Oba Fasalojo scoring in the paint and beyond the arc. Fasalojo led Hononegah with 22 points with four attempts at the line.Rockton-Roscoe NewsGavin Sweeney;Sign up now;Heart Strings: Canjo WorkshopFebruary 7, 2026 @ 10:00 am - 1:00 pm, Nature at the Confluence, 306 Dickop Street, South Beloit, IL 61080Rockton-Roscoe NewsJulie Uram;3rd Annual Old Stone Church Bake SaleSat Feb 7, 2026, 9 am, Old Stone Church, 101 East Union Street, Rockton IL, 61072Rockton-Roscoe NewsRockton-Roscoe News Staff;Yeti Fest Treat TrailSaturday, Feb. 7, 2026, 12 - 3 p.m. Village of Rockton IL, 61072Rockton-Roscoe NewsRockton-Roscoe News Staff;Serenity Sunday Sound BathSaturday, Feb 7, 7pm. Access SOUL High Frequency Sanctuary, Roscoe IL 61073Rockton-Roscoe NewsKelly Simmons;latest forecast;South Beloit FREE Youth Football Camp March 1, 2026Offseason Youth Football camp at the South Beloit High School Gym. Sunday March 1 2026 1 p - 3p. Parents do need to come in and register their player. The camp is free and open t all players from 4th - 8th grade. Thank you to Laura Redieske for theRockton-Roscoe NewsHarold Bone;Death notices for the far Stateline: Feb. 3, 2026We remember those who are no longer with us in Rockton, Roscoe, and South Beloit.Rockton-Roscoe NewsMichael McGinnis;Guilford Vikings beat Hononegah 79-49 in late game shutoutHononegah traveled down to Rockford to play the #1 Guilford Vikings in a NIC-10 matchup that puts Hono a game behind Auburn, and keeps Guilford a game up as they try to secure the conference boys basketball championship. The Feb. 2, 2026 game was close in the first half withRockton-Roscoe NewsGavin Sweeney"}