{"title":"Chemtool settlement nearing an end","path":"/chemtool-settlement-nearing-an-end/","site":"https://roscoenews.com","atUri":"at://did:plc:kn5uqmuxdixjyasof6vmn7na/site.standard.document/3mencgjvrqzi2","publishedAt":"2025-04-30T01:36:03Z","tags":"2021 Chemtool disaster;Analytics Consulting;December 2024;January 2025,;February 2025;Judge Stephen E. Balogh;601 N Main St,;https://illinois17th.com/live-streaming;The Holian settlement: a deeper dive;Holian Insulation settles for $5.5 million in Chemtool fire;Chemtool money begins flowing, with more to come;Chemtool settlement nearing an end;Chemtool explosion: more than a memory;Analytics Consulting is still analyzing Chemtool claims;Looks like Chemtool payments weren't sent in February;Chemtool payments expected to be sent at end of January;Update on Chemtool, sort of;Why your property value affects your Chemtool settlement;Chemtool payments waiting on assessed property values;Chemtool deadline is Saturday, Nov. 23, 2024;Residents will be able to resubmit Chemtool claims that didn't go through;Chemtool claims from more than 100 Rockton residents may be missing;Missing Chemtool claims are being investigated;Judge approves Chemtool settlement;Residents near Chemtool can file claims for a portion of the $94.5 million settlement;Judge will issue preliminary approval of Chemtool settlement in next few weeks;Blackhawk Acres residents can connect to Rockton water at no charge;The unfolding legal chronicles of Chemtool, Lubrizol, Rockton, and Holian;Chemtool cleans up, lawsuits warm up;The EPA found metals in Rockton water in 2004, but not enough to keep testing for them.;Heavy metals found in Rockton neighborhood groundwater, may not be new;Chemtool finally estimates what burned in the fire and what was released over Rockton;Chemtool hasn't released list of materials, says fire reduced everything to its elemental form;Chemtool fire: officials claim they're gathering information, not holding it back;Chemtool responds to state lawsuit;State attorneys file suit against Chemtool for environmental recovery;Environmental expert: be concerned about years, not days, of exposure to chemicals;Rockton fire chief: Chemtool contractor released mineral oil, ignition occurred;Chemtool fire dwindles, cleanup continues, lawsuits emerge;Rockton air quality remains stable, Chemtool will pay for debris cleanup and evacuee expenses;Chemtool employees still being paid, Rockton still under evacuation order;Lubrizol employees in France think they've seen this smoke plume before;Gov. Pritzker sends National Guard to respond to chemical fire in Rockton"}