{"title":"Rockton-Roscoe News: Tuesday, Feb. 17, 2026","path":"/rockton-roscoe-news-thursday-feb-19-2026/","site":"https://roscoenews.com","atUri":"at://did:plc:kn5uqmuxdixjyasof6vmn7na/site.standard.document/3mf2jcxdnyq62","publishedAt":"2026-02-17T12:00:24Z","tags":"Rockton;Roscoe;South Beloit;_Rockton-Roscoe News_;Hononegah rolls in Monday night playoff game against Jefferson, 78–47Early and often the Indians caused turnovers and got buckets against its NIC 10 foeRockton-Roscoe NewsHarold Bone;Lunch detentions follow Hononegah student walkoutDays after a student walkout at Hononegah High School, questions continue to surface regarding disciplinary actions, and communication to families.Rockton-Roscoe NewsHarold Bone;Golden Apple Award Foundation;Roscoe Middle School;Kinnikinnick Schoo;Willowbrook Middle School;Hononegah Community High School;Four local teachers are among 20 finalists for the 2026 Golden Apple Foundation AwardFour of the twenty Golden Apple finalists teach grades 6-12 in Roscoe, Rockton and South Beloit schoolsRockton-Roscoe NewsJean Seegers;Here’s what’s on the agenda for Roscoe trustees this weekThe Roscoe Village Board of Trustees will meet at 6:30 p.m. Tuesday, Feb. 17 at Village Hall, 10631 Main St. A Committee of the Whole meeting is scheduled immediately following the board meeting.Rockton-Roscoe NewsAlycia Dioneda Schneedle;South Beloit City Council to meet MondayAnnexation, equipment purchases, and a deputy clerk hire are among the items on Monday’s South Beloit City Council agenda.Rockton-Roscoe NewsAlycia Dioneda Schneedle;What Rockton officials will be discussing in the weeks aheadRockton leaders have a busy stretch ahead, with multiple meetings scheduled to address redevelopment plans, budget changes, and a proposed multi-use path along Old River Road.Rockton-Roscoe NewsAlycia Dioneda Schneedle;Mark Henderson's Weather Hub;Yeti Fest carved out winter fun for all agesThe yeti made several appearances in Rockton, Illinois during the 2026 Yeti Fest.Rockton-Roscoe NewsMarianne Mueller;Dimke and Simpson shine in Senior Night win over Auburn 74–46Hononegah celebrated two seniors on Friday, Feb. 13, at home against Harlem.Rockton-Roscoe NewsGavin Sweeney;SOBOs force 36 turnovers in 61–15 win over Christian LifeSouth Beloit opened the IHSA 1A girls basketball postseason with the kind of statement win every coach hopes to see in mid‑February. On a spring‑like Valentine’s Day afternoon — temperatures touching 50 degrees with barely a trace of snow on the ground — the SOBOs delivered a 61–15Rockton-Roscoe NewsHarold Bone;_Rockton-Roscoe News_"}