{"title":"Rockton-Roscoe News: Wednesday, Feb. 18, 2026","path":"/rockton-roscoe-news-monday-feb-18-2026/","site":"https://roscoenews.com","atUri":"at://did:plc:kn5uqmuxdixjyasof6vmn7na/site.standard.document/3mf4zsc2kvl42","publishedAt":"2026-02-18T12:00:42Z","tags":"_Rockton-Roscoe News_;Rockton;Roscoe;South Beloit;Shirland;subscriber-only editorial;Death notices for the far Stateline: Feb. 17, 2026We remember those who are no longer with us in Rockton, Roscoe, and South Beloit.Rockton-Roscoe NewsMichael McGinnis;Details behind the South Beloit contract with Metro Paramedic ServicesA three-year contract, 1.4 million dollar contract will provide one fire chief and three staff per 24-hour shift. Opportunities for paid on-call firefighters to follow.Rockton-Roscoe NewsAdam Neblock;Editorial: We knew this was comingWhen a story touches politics, we brace for the comments. We told you what happened. The reaction became its own story.Rockton-Roscoe NewsAlycia Dioneda Schneedle;Sign up now;50 North, Senior Activity Event: Soup’s On!Tuesday, February 17, 2026, 1-3 pm, Rockton Township Community Center at 302 Main St., Rockton IL 61072Rockton-Roscoe NewsDiana LaForge;What Rockton officials will be discussing in the weeks aheadRockton leaders have a busy stretch ahead, with multiple meetings scheduled to address redevelopment plans, budget changes, and a proposed multi-use path along Old River Road.Rockton-Roscoe NewsAlycia Dioneda Schneedle;Here’s what’s on the agenda for Roscoe trustees this weekThe Roscoe Village Board of Trustees will meet at 6:30 p.m. Tuesday, Feb. 17 at Village Hall, 10631 Main St. A Committee of the Whole meeting is scheduled immediately following the board meeting.Rockton-Roscoe NewsAlycia Dioneda Schneedle;latest forecast;Lunch detentions follow Hononegah student walkoutDays after a student walkout at Hononegah High School, questions continue to surface regarding disciplinary actions, and communication to families.Rockton-Roscoe NewsHarold Bone;South Beloit City Council to meet MondayAnnexation, equipment purchases, and a deputy clerk hire are among the items on Monday’s South Beloit City Council agenda.Rockton-Roscoe NewsAlycia Dioneda Schneedle;Hononegah rolls in Monday night playoff game against Jefferson, 78–47Early and often the Indians caused turnovers and got buckets against its NIC 10 foeRockton-Roscoe NewsHarold Bone;Rockton;Roscoe;South Beloit;_Rockton-Roscoe News_"}