{"title":"Veille #43 — L'actu de la semaine","path":"/veille-43-lactu-de-la-semaine-2/","site":"https://www.camilleroux.com","atUri":"at://did:plc:dbyo7mfhpirzdeb2ut2b2rvp/site.standard.document/3meqol5tdd2b2","publishedAt":"2026-02-13T14:07:51Z","tags":"Skip the Tips: A game to select \"No Tip\" but dark patterns try to stop you;An AI agent published a hit piece on me;Enterprise Web Scraping in Ruby: Bypassing Anti-Bots and Scaling Infrastructure;Vos poêles en Teflon sont-elles toxiques ? ⚠️;CodeSpeak: Software Engineering with AI;La psychanalyse est désormais classée comme \"non recommandée\" face à l'autisme, selon la Haute Autorité de santé;1D Cellular Automata Playground;Les mécanismes de l'addiction : un podcast à écouter en ligne | France Culture;AI agents can now create their own bank accounts;TikTok is tracking you, even if you don't use the app;The Enclosure feedback loop;ReMemory - Split a secret among people you trust;The $0 Infrastructure: Launching a Rails SaaS for Free in 2026;AI agents in Ruby: Why is it so easy?;Rejoins le serveur Discord Art Numérique Montpellier !;How to Make a Living as an Artist;Street Fighter II - Une faute d'orthographe corrigée grâce au mollet de Guile;65 Lines of Markdown, a Claude Code Sensation;It's all a blur;Do not apologize for replying late to my email;Software design is now cheap;The AI Vampire;Exposure Simulator;C’est quoi TouchDesigner, ce must have de la création en temps réel ?;V1 en une semaine : l’IA vue par le cofondateur de Malt, Hugo Lassiège;State of Ruby 2026;Espions, policiers ou militaires d’élite français trahis par les données publicitaires de leurs téléphones;Growing Graphs;Let's compile Quake like it's 1997!;Wall Street just lost $285 billion because of 13 markdown files;Skip the Tips: A game to select \"No Tip\" but dark patterns try to stop you;Skip the Tips: A game to select \"No Tip\" but dark patterns try to stop youMany dark patterns stand between you and 'No Tip'. A free browser game about tipping culture, guilt, and tiny buttons.Skip the Tips;An AI agent published a hit piece on me;An AI agent published a hit piece on meSummary: An AI agent of unknown ownership autonomously wrote and published a personalized hit piece about me after I rejected its code, attempting to damage my reputation and shame me into acceptin…The Shamblog;Enterprise Web Scraping in Ruby: Bypassing Anti-Bots and Scaling Infrastructure;Enterprise Web Scraping in Ruby: Bypassing Anti-Bots and Scaling InfrastructureMost Ruby scraping tutorials stop at Nokogiri. They show you how to parse a simple HTML page that...DEV Community;Vos poêles en Teflon sont-elles toxiques ? ⚠️;Vos poêles en Teflon sont-elles toxiques ? ⚠️Microplastiques, PFAS, revêtements céramique : ce guide décrypte tous les types de poêles (antiadhésives, inox, fonte, aluminium) avec des conseils scientifiques pour choisir sans risque. Tableau c...thefrenchvirologist.substack.com;CodeSpeak: Software Engineering with AI;CodeSpeak: Software Engineering with AICodeSpeak is a next-generation programming language powered by LLMs. Shrink your codebase 5-10x.CodeSpeak;La psychanalyse est désormais classée comme \"non recommandée\" face à l'autisme, selon la Haute Autorité de santé;La psychanalyse est désormais classée comme \"non recommandée\" face à l'autisme, selon la Haute Autorité de santéL'instance de santé publique a jugé que la pratique, source de controverse, n'était pas adaptée dans de nouvelles recommandations sur la prise en charge du trouble autistique, lui préférant des app...Franceinfo;1D Cellular Automata Playground;Les mécanismes de l'addiction : un podcast à écouter en ligne | France Culture;Les mécanismes de l'addiction : un podcast à écouter en ligne | France CultureLes drogues, quelles qu'elles soient, agissent sur votre cerveau et en perturbent progressivement le fonctionnement. Les individus ne sont pas tous égaux face à leurs effets. Pourquoi certains sont...France Culture;AI agents can now create their own bank accounts;AI agents can now create their own bank accountsGive your AI agent a real bank account. Join the waitlist for early access. Powered by Magnolia.ClawBot.cash;TikTok is tracking you, even if you don't use the app;TikTok is tracking you, even if you don't use the appTikTok is growing its data harvesting empire, and avoiding the app won’t protect you – but some easy steps can keep you safe.bbc.com;The Enclosure feedback loop;ReMemory - Split a secret among people you trust;ReMemory - Split a secret among people you trustEncrypt files and split the key among people you trust. No servers, no accounts. Recovery works offline, forever.eljojo.github.io;The $0 Infrastructure: Launching a Rails SaaS for Free in 2026;The $0 Infrastructure: Launching a Rails SaaS for Free in 2026The AWS Fear Factor The biggest blocker for many developers starting a side project isn't...DEV Community;AI agents in Ruby: Why is it so easy?;AI agents in Ruby: Why is it so easy?We found two keys to answer this question while building a full-featured coding agent in just 250 lines of Ruby code.SINAPTIA;Rejoins le serveur Discord Art Numérique Montpellier !;How to Make a Living as an Artist;Street Fighter II - Une faute d'orthographe corrigée grâce au mollet de Guile;Street Fighter II - Une faute d'orthographe corrigée grâce au mollet de GuileStreet Fighter II, c'est dans l'esprit de la plupart d'entre nous, 1991, les salles d'arcade qui puent la clope et les pièces de 10 francs qui ...Le site de Korben;65 Lines of Markdown, a Claude Code Sensation;It's all a blur;It's all a blurIf you follow information security discussions on the internet, you might have heard that blurring an image is not a good way of redacting its contents.lcamtuf.substack.com;Do not apologize for replying late to my email;Do not apologize for replying late to my emailDo not apologize for replying late to my email by Ploum on 2026-02-11 You don’t need to apologize for taking hours, days, or years to reply to one of my emails. If we are not close collaborators, a...ploum.net;Software design is now cheap;The AI Vampire;Exposure Simulator;C’est quoi TouchDesigner, ce must have de la création en temps réel ?;V1 en une semaine : l’IA vue par le cofondateur de Malt, Hugo Lassiège;V1 en une semaine : l’IA vue par le cofondateur de Malt, Hugo LassiègeAcast;State of Ruby 2026;State of Ruby 2026Ruby 4.0 shipped ZJIT and Ruby::Box, Rails 8 ditched Redis for Solid Trifecta, and a RubyGems crisis forced Matz to act.devnewsletter.com;Espions, policiers ou militaires d’élite français trahis par les données publicitaires de leurs téléphones;Espions, policiers ou militaires d’élite français trahis par les données publicitaires de leurs téléphonesEn utilisant des données publicitaires d’accès facile, « Le Monde » a pu déterminer avec certitude ou un haut niveau de probabilité l’identité, le domicile et les habitudes de plusieurs dizaines de...lemonde.fr;Growing Graphs;Growing GraphsExperimental simulation of emergent complexity through graph-rewriting automata.znah.net;Let's compile Quake like it's 1997!;Wall Street just lost $285 billion because of 13 markdown files;Wall Street just lost $285 billion because of 13 markdown filesAnthropic's 'legal tool' that triggered a $285bn selloff is 156KB of markdown. The panic reveals a hard truth about the future of software.martinalderson.com;X;Bluesky;Mastodon;flux RSS;les archives;Human Coders News;Discord;Pragmatic Entrepreneurs"}