{"title":"Veille #44 — L'actu de la semaine","path":"/veille-44-lactu-de-la-semaine/","site":"https://www.camilleroux.com","atUri":"at://did:plc:dbyo7mfhpirzdeb2ut2b2rvp/site.standard.document/3mfc6a2zceox2","publishedAt":"2026-02-20T13:03:21Z","tags":"Claude: All you need is context;Claude: All you need is contextYouTube;« Coach de l’âme », énergéticien… Qui sont ces « entrepreneurs spirituels »;« Coach de l’âme », énergéticien… Qui sont ces « entrepreneurs spirituels »Numérologie, reiki et lectures akashiques... Des autoentrepreneurs spirituels surfent sur la vague du bien-être pour transformer leur expérience de vie en business avec, parfois, le risque de dériv...20 Minutes;GitHub - millionco/react-doctor: Let coding agents diagnose and fix your React code;GitHub - millionco/react-doctor: Let coding agents diagnose and fix your React codeLet coding agents diagnose and fix your React code - millionco/react-doctorGitHub;Introducing Upright: An Open Source Synthetic Monitoring System;Introducing Upright: An Open Source Synthetic Monitoring SystemWe’re open-sourcing Upright, the synthetic monitoring system we built to watch over Basecamp, HEY, Fizzy and our many other services.37signals Dev;The open-source voice synthesis studio powered by Qwen3-TTS.;The open-source voice synthesis studio powered by Qwen3-TTS.The open-source voice synthesis studio powered by Qwen3-TTS.Open-source Projects;Womens Sizing;Womens SizingThe inter-generational struggle to find clothes that fit more than a tiny portion of womenThe Pudding;Show HN: Strava for Claude Code;Show HN: Strava for Claude CodeTrack your Claude Code usage, share your wins, and compete on the leaderboard. The social platform for AI-assisted coding.Straude;Claude Sonnet 4.6;Claude Sonnet 4.6Claude Sonnet 4.6 is a full upgrade of the model’s skills across coding, computer use, long-reasoning, agent planning, knowledge work, and design.anthropic.com;comment inspirer la prochaine generation de filles dans la tech et les sciences 0ab8ede50bf6;GitHub - fluxerapp/fluxer: A free and open source instant messaging and VoIP platform built for friends, groups, and communities.;GitHub - fluxerapp/fluxer: A free and open source instant messaging and VoIP platform built for friends, groups, and communities.A free and open source instant messaging and VoIP platform built for friends, groups, and communities. - fluxerapp/fluxerGitHub;WebMCP est disponible en preview anticipée | Blog | Chrome for Developers;WebMCP est disponible en preview anticipée | Blog | Chrome for DevelopersWebMCP vise à fournir une méthode standard pour exposer des outils structurés, en veillant à ce que les agents d'IA puissent effectuer des actions sur votre site avec plus de rapidité, de fiabilité...Chrome for Developers;Modern CSS Code Snippets;Modern CSS Code SnippetsA collection of modern CSS code snippets. Every old CSS hack next to its clean, native replacement, side by side.modern.css;accomplish-ai/accomplish;accomplish-ai/accomplishAccomplish™ (formerly Openwork) is the open source Al coworker that lives on your desktop - accomplish-ai/accomplishGitHub;AI optimism is a class privilege;AI optimism is a class privilegeI think I have an idea why we're so extremely divided on AI: it's because we have an intuitive sense of who it stands to benefit, and who stands to pay the costs. I think whether you see reason for...Josh Collinsworth;GitHub - vakra-dev/reader: Open-source, production-grade web scraping engine built for LLMs. Scrape and crawl the entire web, clean markdown, ready for your agents.;GitHub - vakra-dev/reader: Open-source, production-grade web scraping engine built for LLMs. Scrape and crawl the entire web, clean markdown, ready for your agents.Open-source, production-grade web scraping engine built for LLMs. Scrape and crawl the entire web, clean markdown, ready for your agents. - vakra-dev/readerGitHub;GitHub - getmaxun/maxun: ✨ The open-source no-code platform for web scraping, crawling, search and AI data extraction • Turn websites into structured APIs in minutes ✨;GitHub - getmaxun/maxun: ✨ The open-source no-code platform for web scraping, crawling, search and AI data extraction • Turn websites into structured APIs in minutes ✨✨ The open-source no-code platform for web scraping, crawling, search and AI data extraction • Turn websites into structured APIs in minutes ✨ - GitHub - getmaxun/maxun: ✨ The open-source no-code ...GitHub;I gave Claude access to my pen plotter;Real-time PathTracing with global illumination in WebGL;AI is going to kill app subscriptions;AI is going to kill app subscriptionsCurated niche app opportunities from Reddit, scored by difficulty and demand.nichehunt.app;No Coding Before 10am;No Coding Before 10amEngineering is no longer about writing code. Here is one startup's playbook for building in the AI agent era.michaelxbloch.substack.com;Flashpoint Archive – Over 200k web games and animations preserved;Claude Code Tips From the Guy Who Built It;Claude Code Tips From the Guy Who Built ItBoris Cherny created Claude Code at Anthropic. Over three Twitter threads (early January, late January, and February 2026), he shared how he and the Claude Code team use it every day. His setup is,...Anup Jadhav;Il recrée le cœur de ChatGPT en 243 lignes et sans aucune bibliothèque;Il recrée le cœur de ChatGPT en 243 lignes et sans aucune bibliothèqueLe 11 février 2026, Andrej Karpathy a affirmé sur X avoir recréé un modèle GPT en seulement 243 lignes de Python. Une expérience pédagogique qui démonte pièce par pièce la mécanique des intelligenc...Numerama;GitHub - AgriciDaniel/claude-seo: Universal SEO skill for Claude Code. Comprehensive SEO analysis for any website or business type.;GitHub - AgriciDaniel/claude-seo: Universal SEO skill for Claude Code. Comprehensive SEO analysis for any website or business type.Universal SEO skill for Claude Code. Comprehensive SEO analysis for any website or business type. - AgriciDaniel/claude-seoGitHub;A programmer's loss of identity;Shades of Halftone;Shades of HalftoneAn interactive deep dive into building halftone shaders in GLSL, covering everything from classic dot patterns and CMYK color separation to Moiré interference, gooey effects, and animated displacem...The Blog of Maxime Heckel;Turning YouTube Into Cloud Storage;Turning YouTube Into Cloud StorageYouTube;Can you rewire your brain?;Can you rewire your brain?The metaphor of rewiring offers an ideal of engineered precision. But the brain is more like a forest than a circuit boardaeon.co;Gemini Deep Think: Redefining the Future of Scientific Research;Gemini Deep Think: Redefining the Future of Scientific ResearchGemini Deep Think is accelerating discovery in maths, physics, and computer science by acting as a powerful scientific companion for researchers.Google DeepMind;GitHub - pshenok/server-survival: Tower defense game that teaches cloud architecture. Build infrastructure, survive traffic, learn scaling.;GitHub - pshenok/server-survival: Tower defense game that teaches cloud architecture. Build infrastructure, survive traffic, learn scaling.Tower defense game that teaches cloud architecture. Build infrastructure, survive traffic, learn scaling. - pshenok/server-survivalGitHub;GitHub - tw93/Kaku: 🎃 A fast, out-of-the-box terminal built for AI coding.;GitHub - tw93/Kaku: 🎃 A fast, out-of-the-box terminal built for AI coding.🎃 A fast, out-of-the-box terminal built for AI coding. - tw93/KakuGitHub;GitHub - breaking-brake/cc-wf-studio: CC Workflow Studio;GitHub - breaking-brake/cc-wf-studio: CC Workflow StudioCC Workflow Studio. Contribute to breaking-brake/cc-wf-studio development by creating an account on GitHub.GitHub;GitHub - jlia0/tinyclaw: TinyClaw is a team of personal agents that collaborate with each other;GitHub - jlia0/tinyclaw: TinyClaw is a team of personal agents that collaborate with each otherTinyClaw is a team of personal agents that collaborate with each other - jlia0/tinyclawGitHub;Catalog of Refactorings;Introducing Code Wiki: Accelerating your code understanding- Google Developers Blog;Introducing Code Wiki: Accelerating your code understanding- Google Developers Blogdevelopers.googleblog.com;Cloudflare adds real-time Markdown rendering for AI agents;Cloudflare adds real-time Markdown rendering for AI agentsThe way content is discovered online is shifting, from traditional search engines to AI agents that need structured data from a Web built for humans. It’s time to consider not just human visitors, ...The Cloudflare Blog;X;Bluesky;Mastodon;flux RSS;les archives;Human Coders News;Discord;Pragmatic Entrepreneurs"}