{"title":"We should all spend less time online","path":"/we-should-all-spend-less-time-online/","site":"https://www.cathiharris.com","atUri":"at://did:plc:wrlj7xdi3kqb7bs4lf7swqcu/site.standard.document/3me6nw67sumu2","publishedAt":"2025-05-13T10:18:52Z","tags":"unauthorized social experiment;Fact check: AI influencers targeting German elections – DW – 02/05/2025They look appealing and spread right-wing disinformation on social media: AI-generated influencers are posting political content on social media. Who is behind them, and what exactly is their goal?dw.comKathrin Wesolowski;How I Became a TikTok TrutherThe platform has created a distorted alternate reality that endangers our collective wellbeingMediumCathi Harris;how I realized I was susceptible to misinformation on Tiktok;on social media;I Don’t Like Myself on FacebookDon’t delete your account because of #FakeNews, do it because it’s bad for youMediumCathi Harris;social media propaganda campaigns;[25];25] Twitter stated that it had found 36,000 Russian bots spreading tweets related to the [2016 United States elections;2016 United States elections.[[26];[26] Russia has used social media to destabilize former Soviet states such as Ukraine and Western nations such as France and Spain.[[27];26] Russia has used social media to destabilize former Soviet states such as Ukraine and Western nations such as France and Spain.[[27] It has been suggested that since 2019, Russian-sponsored troll accounts and bots have formed and taken over prominent left-wing and right-wing subreddits on Reddit, such as the antiwar, greenandpleasant, and aboringdystopia subreddits, \"suggest[ing] a Russian-led attempt to antagonize and influence Americans online, which is still ongoing.\"[[28];Internet Research Agency;Two men jailed for social media posts that stirred up far-right violencePeople who threw stones, hurled racist abuse and pushed a burning wheelie bin at police also sent to prisonThe GuardianJessica Murray;a mass stabbing incident;German broadcaster, ZDF;Magdeburg;Munich;Mannheim;German federal election;Mark Zuckerberg says people can fill the need for friends with AI, but ‘there is no replacement’ for human relationships, psychologist saysMeta CEO Mark Zuckerberg recently said AI could fill the need for human relationships. That’s “definitely not supported by research,” says expert.CNBCGili Malinsky"}