{"title":"Findings, Jan 2026","path":"/findings-jan-2026/","site":"https://www.elliotcsmith.com","atUri":"at://did:plc:3gxxq3zrwn7ds3snxr4xhzrz/site.standard.document/3me6isjmcfim2","publishedAt":"2026-02-06T08:36:47Z","tags":"pynb — Python Notebooks Without the FussPython notebooks without the fuss. Fast, local notebooks for data science and machine learning. Privacy-first.pynb;Stripe Press — MaintenanceAn in-depth exploration of maintenance, and a powerful argument for its civilizational importance.Twitter;INTVLINTVL Website;The Strength of the Few (Hierarchy, #2)This highly anticipated follow-up to The Will of the Ma…GoodreadsJames Islington;PolarsDataFrames for the new eraOptiver;Return of the Obra Dinn on SteamLost at sea 1803 ~ The good ship Obra Dinn.STEAM;A Social Filesystem — overreactedFormats over apps.;Mostly GrowthMostly Growth is a podcast from Mostly Media where go-to-market strategist Kyle Poyar and CFO CJ Gustafson break down how modern companies make money. Each episode focuses on pricing, monetization, and benchmarks—translated into clear tactics and playbooks you can actually use. Built for finance, product, and sales operators who want to think like owners and be the CEO of their role.YouTube;Some notes on starting to use DjangoSome notes on starting to use DjangoJulia EvansJulia Evans;How to, mostly, guarantee success in your careerOver my career so far I have done a lot of different things. I’ve written code, designed PCBs and MRI machines, run Google ads, been out on the road doing sales and managed teams doing all of the above. Overall, regardless of the job at hand, I think I’ve foundElliot C SmithElliot Smith;Things I changed my mind about in 2025It’s still the tail end of January so I am going to use this time as an excuse to sneak in a ’2025 reflection’ type post. This could easily be just about things I’ve changed my mind on recently but I figure I’ll use the new year as a framework.Elliot C SmithElliot Smith;Has AI removed the appeal of vertical SaaS?Let’s put aside for a moment the question of ‘is AI bad for humanity’ and accept that it is a thing that exists in the world. Particularly in the world of ‘tool that writes code’. Right now, for circa $200 a month you can buy a tool that can writeElliot C SmithElliot Smith;Playing around with Google StitchThis week I spent some time using Google Stitch, an AI chat interface for product mock ups. There are a lot of these kind of products, Figma has one, so does Canva. Stitch is the first one I’ve used that is filling a real need for me. That need? ProducingElliot C SmithElliot Smith"}