{"title":"Secretly Incredibly Fascinating: Garlic","path":"/episodes/secretly-incredibly-fascinating/secretly-incredibly-fascinating-garlic/","site":"https://maximumfun.org","atUri":"at://did:plc:5tl3khik6spimxlktpatwwbh/site.standard.document/3megmajjqbjr2","publishedAt":"2026-02-09T09:05:49Z","tags":"medicine;Italy;garlic;Ellen Weatherford;food;Alex Schmidt;India;mythology;Chemistry;ancient Egypt;herbs;ancient Greece;china;botany;Korea;**'Just The Zoo Of Us' podcast (Maximum Fun)**;Ellen Weatherford on TikTok;'Spellbound and Gagged' podcast;preview of the special \"Cheddar Heist\" podcast by Ellen Weatherford, Ella Hubber, Tom Lum, and Caroline Roper;native-land.ca;U.S. Department Of Arts And Culture;The True Native New Yorkers Can Never Truly Reclaim Their Homeland (Smithsonian);\"Finding Lenapehoking\" (YouTube / Hudson River Maritime Museum);Why Do They Call It Beacon? (The Highlands Current);Dutch & Native American Heritage In The Hudson River Valley (National Park Service);**_Garlic: An Edible Biography_ by Robin Cherry**;**The origins and distribution of garlic: How many garlics are there? (USDA Agricultural Research Service)**;Garlic, Allium sativum (University of Wisconsin-Madison Horticultural Extension);Garlic -- Allium sativum (Oregon State University College Of Agricultural Sciences);Garlic vs. Purple Garlic: What's the Difference? (AllRecipes.com);Lifestyle: Food: Am I Blue? (The Washington Post);Allium canadense -- Meadow Garlic, Wild Garlic, Wild Onion (Lady Bird Johnson Wildflower Center at UT Austin);Allium tricoccum -- Wild Leek, Ramp (Lady Bird Johnson Wildflower Center at UT Austin);Plant of the Month: Garlic Mustard (JStor Daily);Hot New Medicine: This 1,000-Year-Old Mixture of Garlic, Onion, Wine, and Cow Bile (Popular Mechanics);Staph Infection (Cleveland Clinic);The Scientific Secret of Garlic (Carnegie Museums);Why Does My Garlic Turn Green? | Ask The Food Lab (Serious Eats);You can taste garlic with your feet (Popular Science);The 2025 Ig Nobel Prizes honor garlicky babies, drunk bats, and more (Popular Science);The Ig Nobels are science's most lighthearted event. This year is 'not typical' (Science);How ‘Ennobling’ Helped Italian Aristocrats Solve the Problem of Garlic (Gastro Obscura);Garlic and Social Class: Immigrants from southern Italy were stereotyped for their use of the aromatic vegetable. (JStor Daily);Italian Garlic Debate Raises a Culinary Stink (NPR);It's A Wonderful (Italian-American) Life (NPR);Sweets: Garlic Ice Cream (Gastro Obscura);Secretly Incredibly Fascinating: Apples;Secretly Incredibly Fascinating: Neapolitan Ice Cream;Secretly Incredibly Fascinating: Diabetes"}