{"title":"Secretly Incredibly Fascinating: Doughnuts","path":"/episodes/secretly-incredibly-fascinating/secretly-incredibly-fascinating-doughnuts/","site":"https://maximumfun.org","atUri":"at://did:plc:5tl3khik6spimxlktpatwwbh/site.standard.document/3meyk4lqlbfz2","publishedAt":"2026-02-16T09:05:45Z","tags":"Muslim;doughnuts;Massachusetts;Dunkin;Breakfast;southern California;Police;Cambodia;donuts;Tim Hortons;Ramadan;Ted Ngoy;Tom Lum;food;Alex Schmidt;Los Angeles;World War One;Canada;dessert;Donut Pub;Hole Doughnuts;**'Let's Learn Everything' podcast (Maximum Fun)**;'Our Findings Show!': The Science Game Show, hosted by Tom Lum;Tom Lum on TikTok;Alex & Katie guesting on 'Let's Learn Everything';preview of the special \"Cheddar Heist\" podcast by Ellen Weatherford, Ella Hubber, Tom Lum, and Caroline Roper;native-land.ca;U.S. Department Of Arts And Culture;The True Native New Yorkers Can Never Truly Reclaim Their Homeland (Smithsonian);\"Finding Lenapehoking\" (YouTube / Hudson River Maritime Museum);Why Do They Call It Beacon? (The Highlands Current);Dutch & Native American Heritage In The Hudson River Valley (National Park Service);The History of the Doughnut: A look back at the men, women and machines that made America’s favorite treat possible (Smithsonian Magazine);A Deep-Fried History of Doughnuts (Mental Floss);12 Delicious Doughnuts From Around the World (Mental Floss);New York doughnut history: From Washington Irving’s olykoeks to doughnut huts in Union Square (The Bowery Boys Podcast);The Maine Ship Captain Who Invented the Modern Donut (New England Historical Society);A 'holey' Quincy story of how a sea captain invented a doughnut that didn't sink (The Patriot Ledger);Doughnut Holes (The Paris Review);BibleGateway.com page for Leviticus 7:12;Chinese Cooking Demystified: \"Youtiao, Chinese Fried Dough Stick (油条)\" (YouTube);Sel Roti -- Nepali Rice Doughnut (DelishGlobe.com);Donuts: The ‘hole’ Jewish story (Jewish Chicago Magazine);Winston-Salem, North Carolina: Site of the Original Krispy Kreme Doughnut Shop (Atlas Obscura);Quincy, Massachusetts: First Dunkin' Donuts (Atlas Obscura);No, Dunkin' Didn't Invent Donut Holes. Here's Who Did. (Tasting Table Magazine);After Fasting for Ramadan, Only Doughnuts Will Do (The New York Times);Hockey-Reference.com listing for Tim Horton;Tim Horton (Ontario Heritage Trust);Tim Horton: A Legacy of Hockey, Donuts, & Coffee (TheHockeyWriters.com);Sunday Morning: Donuts To Dollars (CBS News);Ron Joyce, Force Behind Tim Hortons Doughnut Shops, Dies at 88 (The New York Times);The Little-Known History of Apple Cider Doughnuts (Mental Floss);Dunkin' Donuts In Certain Boston Areas Stay Open To Serve Police During City Lockdown (HuffPost);Research Guides: 2013 Boston Marathon (Boston Public Library);This Is Why Doughnuts Are Associated With Police Officers (Time Magazine);The Long, Sweet Love Affair Between Cops and Doughnuts (Gastro Obscura);_The Donut King_ -- 2020 documentary, dir. Alice Gu;The Donut King who went full circle - from rags to riches, twice (BBC News);Dunkin' Donuts opens first Southern California shop in Santa Monica (Los Angeles Times);Wreck-It Ralph Fandom Wiki entry for Wynnchel and Duncan;The Salvation Army Doughnut Dollies of WW1: An interview with Sandra Maxwell (The United States World War One Centennial Commission);Doughboys and the Birth of the Modern American Army (The National WWI Museum And Memorial);U.S. Enters the War: Learn about the events that led the U.S. to enter WWI in 1917 (The National WWI Museum And Memorial);The Delicious Democratic Symbolism of...Doughnuts? (JStor Daily)"}