{"title":"Guilty Without Trial: Spain Orders NordVPN and ProtonVPN to Police the Internet for LaLiga","path":"/guilty-without-trial-spain-orders-nordvpn-and-protonvpn-to-police-the-internet-for-laliga/","site":"https://www.myprivacy.blog","atUri":"at://did:plc:e5vts7k5d4ncuopw6qerachg/site.standard.document/3mf5mct5tjbu2","publishedAt":"2026-02-18T17:32:11Z","tags":"Iran’s 2026 Internet Blackout: 20 Days Offline, 30,000+ Dead, and the Plan for Permanent Digital IsolationIran entered its 20th consecutive day of near-total internet blackout on January 28, 2026, as the Islamic Republic implements what cybersecurity experts describe as the most sophisticated and severe internet shutdown in the country’s history. What began on January 8 as a response to nationwide protests has evolved into aBreached CompanyBreached Company;Wisconsin’s “Digital ID” Bill is a Privacy Nightmare—And Lawmakers Don’t Understand How the Internet WorksThe Wisconsin State Senate is currently fast-tracking legislation that promises to “protect the children” but delivers something far more dangerous: a fundamental dismantling of online privacy for every adult in the state. Under the guise of shielding minors from harmful content, Senate Bill 130 (and its Assembly counterpart AB 105)My Privacy BlogMy Privacy Blog;Proton Mail’s Legal Battle for Privacy: Challenging Australia’s eSafety RegulatorIntroduction Proton, the Switzerland-based encrypted email service, has taken a firm stand against the Australian online safety regulator’s proposed standards that could potentially weaken encryption. The company’s founder, Andy Yen, has vowed to fight in court rather than compromise user privacy. Proton will never break encryption for any gov’t. IfMy Privacy BlogMy Privacy Blog;Michigan Republicans Introduce Sweeping Internet Censorship Bill: HB 4938 Targets VPNs, Adult Content, and Transgender ExpressionBottom Line: Michigan House Bill 4938 represents one of the most expansive state-level internet censorship proposals in U.S. history, completely outlawing VPNs with $500,000 fines, requiring 24/7 surveillance of all internet traffic, and criminalizing vast categories of content including adult material, AI-generated content, and transgender depictions, withMy Privacy BlogMy Privacy Blog;Denmark Withdraws VPN Ban After Public Outcry—But the Global War on VPNs is Just BeginningExecutive Summary: Denmark’s Ministry of Culture withdrew controversial provisions targeting VPN usage from its anti-piracy legislation on December 16, 2025, after fierce backlash from privacy advocates and digital rights groups. However, this victory represents a single battle in a much larger war, as governments worldwide—from Michigan to Australia toMy Privacy BlogMy Privacy Blog;UAE’s Battle Against VPN Abuse in The Digital Age: Safeguarding the Cyber RealmIn an increasingly interconnected society where digital innovation is the norm rather than the exception, the importance of fortifying the ‘virtual walls’ against impending cyber threats has reached an unprecedented high. The United Arab Emirates (UAE), a nation renowned for its technological prowess, finds itself confronted with a growing digitalMy Privacy BlogMy Privacy Blog;Russia’s WhatsApp and VPN Restrictions: Separating Fact from FictionBottom Line: The claim about Russia banning WhatsApp and VPNs starting August 1st, 2025, is false. However, Russia is indeed moving toward restricting both platforms through recent legislation and political pressure — just not on the specific date claimed. WhatsApp Disrupts Spyware Campaign Targeting Journalists and Civil Society MembersWhatsApp, the popularMy Privacy BlogMy Privacy Blog"}