{"title":"The Berlin Ruling: Transparency or Surveillance? German Court Orders X to Surrender Data on Hungarian Election","path":"/the-berlin-ruling-transparency-or-surveillance-german-court-orders-x-to-surrender-data-on-hungarian-election/","site":"https://www.myprivacy.blog","atUri":"at://did:plc:e5vts7k5d4ncuopw6qerachg/site.standard.document/3mf5lovfactm2","publishedAt":"2026-02-18T17:21:01Z","tags":"Ireland Takes Aim at X While Europe Wages War on Free Speech: The DSA Censorship Machine ExposedIreland isn’t just regulating X—it’s leading Europe’s charge to control what you can say online. In a coordinated assault on one of the last remaining platforms for relatively unrestricted speech, Ireland’s regulators have launched multiple investigations into X (formerly Twitter) while the broader European Union wields the Digital ServicesMy Privacy BlogMy Privacy Blog;Navigating the Digital Crossroads: EDPB’s Groundbreaking Guidelines on DSA-GDPR InterplayExecutive Overview: A New Era of Digital Compliance The European Data Protection Board (EDPB) has released its first comprehensive guidelines (Guidelines 3/2025) on the complex interplay between the Digital Services Act (DSA) and the General Data Protection Regulation (GDPR). This landmark guidance, adopted on September 11, 2025, represents aCompliance Hub WikiCompliance Hub;Poland’s DSA Request Opens Door to Algorithmic Political Speech FilteringWhen government pressure meets platform moderation, the censorship doesn’t need a formal order Poland’s deputy digital minister just weaponized the Digital Services Act in a way that should concern anyone who values open political debate online. On December 29, 2025, Dariusz Standerski sent a letter to the European Commission requestingCompliance Hub WikiCompliance Hub;Europe Flexes Its Regulatory Muscle: Meta and TikTok Face Historic DSA Enforcement ActionExecutive Summary: In a landmark enforcement move on October 24, 2025, the European Commission issued preliminary findings that Meta (Facebook and Instagram) and TikTok have breached core transparency and user protection obligations under the Digital Services Act. This represents one of the first major salvos of DSA enforcement against VeryCompliance Hub WikiCompliance Hub"}