{"title":"Designy Digest / 001","path":"/designy-digest-001/","site":"https://www.designy.com","atUri":"at://did:plc:wbakieni5lec2yyexu3i7rct/site.standard.document/3merl64lbmz62","publishedAt":"2026-02-13T22:39:31Z","tags":"You Can’t Automate ChaosOver the past year, I’ve noticed a pattern across organizations exploring AI: They’re not starting with broken technology. They’re starting with broken processes.LinkedInMarc Speed;Every design professional I talk to right now has the same anxiety: AI's moving too fast for me to keep up. I recently shared my concerns about where UX is heading. But worry without action is… | James MarshallEvery design professional I talk to right now has the same anxiety: AI’s moving too fast for me to keep up. I recently shared my concerns about where UX is heading. But worry without action is pointless. So here’s what I think we can actually do about it. The reality is, no one truly understands how this plays out. Anyone who tells you exactly how the future unfolds is hypothesising at best. In 2003, Dave Brailsford took over British Cycling. The team had won just one Olympic gold in its entire history. His first move was to stop obsessing over medals. Instead, he focused on “marginal gains”. An obsessive attention to the inputs he could control. How they slept. How they washed their hands. The fabric of their shorts. Making sure each rider had the same pillow every night. Every detail, every day. It led to 7 Tour de France wins and Olympic dominance. We’re all still figuring this out. Which means there’s still time to build your standard of performance before the game is decided. Spending all your time predicting AI’s next move, or getting sidetracked by the latest declaration of what’s dead and why everything is different now, is a losing formula. What you can control is how your team learns new tools and integrates them into workflows. You can control having real taste on your team, because the only moat against AI saturation is creating experiences people genuinely value. You can control who you hire. Curious people who understand human behaviour and can craft world-class experiences. Focus on what you can control. Everything else is noise. You do those things, winning will take care of itself.LinkedInJames Marshall;on purpose here on Designy.;AI promised to democratize design, but instead, it’s turning decision-making away from designers.Photo by Igor Omilaev on UnsplashMediumCraig Moser;It is a teachable skill;The Daily Sprint"}