{"title":"ChatGPT 4o Is Permanently Retired","path":"/chatgpt-4o-is-permanently-retired/","site":"https://marketingjunto.com","atUri":"at://did:plc:7zac5v7uj535mdckkdazki3k/site.standard.document/3mf55zcltodb2","publishedAt":"2026-02-18T13:16:13Z","tags":"OpenAI has permanently retired ChatGPT 4o after bringing it back for paid users after backlash a while back.;Fediverse/Open Web-connected forum for podcasting;Let's chat and see if I can help you!;https://entrepreneursenigma.com/jakewysocki;Looking for guests? Want to be on podcasts? Check out Podmatch!;Apple introduces a new video podcast experience on Apple PodcastsApple Podcasts will enable HLS video podcasts with a best-in-class experience for creators and usersPodnewsApple Podcasts;Anthropic’s Super Bowl ads mocking AI with ads helped push Claude’s app into the top 10 | TechCrunchThe numbers suggest that Anthropic’s Super Bowl commercials, combined with Anthropic’s recent release of its new Opus 4.6 model, worked to drive attention to Claude’s app and its key differentiator from ChatGPT.TechCrunchSarah Perez;What’s behind the mass exodus at xAI?Departures during a restructuring are normal — but internal tensions might play a role as well.The VergeHayden Field;Why is Bezos trolling Musk on X with turtle pics? Because he has a new Moon plan.It’s time to go back to the Moon—this time to stay.”Ars TechnicaEric Berger;Meta Tests a Standalone AI Video AppMeta says the volume of content being generated via its AI app has increased significantly.Social Media TodayAndrew Hutchinson;LinkedIn Adds SMB-Focused Premium SubscriptionThe package aims to make it easier for SMBs to maximize their in-app presence.Social Media TodayAndrew Hutchinson;Google’s Search Relations Team Debates If You Still Need A WebsiteGoogle’s Search Relations team discussed whether you still need a website in 2026, and outlined when social, apps, or the web make sense.Search Engine JournalMatt G. Southern;WP Engine Complaint Adds Unredacted Allegations About Mullenweg PlanWordPress co-founder and Automattic are alleged in amended complaint to have planned to target at least ten competitors.Search Engine JournalRoger Montti;The EU moves to kill infinite scrollingBrussels is going head-to-head with social media platforms to change addictive design.POLITICOEliza Gkritsi;Playing the game on the fieldIf we’re going to introduce new RSS-based features, they should reflect what podcasters and listeners want. The biggest danger to our project is adopting our own pet-projects instead of building stuff creators actually want to use.Podcast Standards Project;Ring cancels Flock deal after dystopian Super Bowl ad prompts mass outrage“This is definitely not about dogs,” senator says, urging a pause on Ring face scans.Ars TechnicaAshley Belanger;Seven Billion Reasons for Facebook to Abandon its Face Recognition PlansMeta’s analysis that it can avoid scrutiny by releasing a privacy invasive product during a time of political crisis is craven and morally bankrupt. It is also dead wrong.Electronic Frontier FoundationMario Trujillo;Spotify says its best developers haven’t written a line of code since December, thanks to AI | TechCrunchSpotify credits Claude Code and its internal AI system Honk with speeding up development.TechCrunchSarah Perez;Elon Musk’s X Appears to Be Violating US Sanctions by Selling Premium Accounts to Iranian LeadersWhile publicly supporting protesters in Iran, Elon Musk’s X appears to have been selling premium accounts to regime officials. Check marks were removed from certain accounts after a WIRED inquiry.WIREDDavid Gilbert;A newbie’s guide to self-hosting with YunoHostHere is a 4-part guide about how to get started self-hosting essential internet services with the YunoHost systemElena RossiniElena Rossini;YunoHost.org;OpenClaw creator Peter Steinberger joining OpenAI, Altman saysOpenClaw, the open source AI agent that’s surged in popularity in recent weeks, will live within OpenAI, according to a post on X from Sam Altman.CNBCAshley Capoot,Ari Levy;(@emilyforlini.bsky.social);02/15/2026 15:27:57;Post by @Vivaldi@vivaldi.net View on Mastodon;Building the WebIdeas that Built the WebBuilding the Web;Frogpants.com;Credit;Post by @quillmatiq@mastodon.social View on Mastodon;Post by @stratofax@indieweb.social View on Mastodon;_pay-what-you-want subscription_"}