{"title":"FLTR#7 : Une app pour les gouverner tous","path":"/fltr-7-une-app-pour-les-gouverner-tous/","site":"https://da.van.ac","atUri":"at://did:plc:yc5bdaprlbzruqnilm5zvqob/site.standard.document/3meejdrx45qw2","publishedAt":"2026-02-08T18:00:41Z","tags":"le Washington Post a licencié plus de 300 personnes;40 millions pour un documentaire Melania Trump;visitait Blue Origin;lunaire NASA de 3,4 milliards.;Damien Van Achter;Depuis 2005;J'explique ici;abonner en 1 clic;à mon agenda;Twitter, 44 milliards;288 millions de donations;5,9 milliards Space Force;41 États, partenariat Visa;« Vous n'aurez plus besoin d'un compte en banque »;fusionné SpaceX et xAI dans un méga-deal à 1 250 milliards de dollars;WeChat concentre messagerie, réseau social, paiements, commerce et services gouvernementaux;1,3 milliard d'utilisateurs;ne plus pouvoir payer son loyer, prendre un taxi ou accéder à ses dossiers médicaux;un instrument de censure et de surveillance à grande échelle;Foreign Policy qualifie d'outil « ultime d'autoritarisme »;« le WeChat de l'Occident »;« Les super-apps s'intègrent parfaitement à l'ambition de l'État d'organiser tous les aspects de la vie des citoyens pour le contrôle politique »;en demandant le rejet de la licence X Money;StopHateForProfit avait démontré en 2020;10 109 docteurs STEM ont quitté les agences fédérales;Eurosky;remplace Zoom et Teams par des outils souverains;restreignent le partage de renseignements avec les États-Unis;W;IEEE P7700 : quand les ingénieurs prennent l’éthique en mainL’IEEE développe le premier standard socio-technique pour les neurotechnologies grand public, face au vide réglementaire des casques connectésDamien Van Achter - First Learn The Rules. Then Break ThemDamien Van Achter;⚡ Et maintenant ?Retrouvez toutes les pistes d’action publiées dans nos articles. Filtrez selon vos moyens, votre contexte, vos ambitions - et passez à l’action.Damien Van Achter - First Learn The Rules. Then Break ThemDamien Van Achter;32 députés européens exigent une enquête sur la censure post-rachat TikTok32 élus européens soupçonnent TikTok de censurer certains contenus depuis le rachat par les alliés de Trump, notamment sur les dossiers Epstein et les manifestations anti-ICE.Damien Van Achter - First Learn The Rules. Then Break ThemDamien Van Achter;10 109 experts fuient l’État : Trump vide la science américaineEn un an, 10 109 docteurs STEM ont quitté les agences fédérales américaines, créant un brain drain interne sans précédent qui menace les capacités scientifiques publiques.Damien Van Achter - First Learn The Rules. Then Break ThemDamien Van Achter;USA: Le DHS cible les comptes anonymes qui documentent l’ICELe Department of Homeland Security utilise des assignations administratives — sans contrôle judiciaire — pour forcer les entreprises tech à révéler l’identité de comptes anonymes qui documentent les opérations d’immigration.Damien Van Achter - First Learn The Rules. Then Break ThemDamien Van Achter;L’État fédéral américain absorbe les méthodes miliciennes d’extrême droiteL’administration fédérale déploie 3000 agents ICE avec les mêmes tactiques d’intimidation que les Proud Boys, qui se retirent des rues car ‘le gouvernement fait le travail à leur place’.Damien Van Achter - First Learn The Rules. Then Break ThemDamien Van Achter;États-Unis : l’application Mobile Fortify transforme l’immigration en état de surveillanceL’application de reconnaissance faciale Mobile Fortify, utilisée 100 000 fois depuis mai 2025, scanne des citoyens américains sans leur consentement lors d’opérations d’immigration.Damien Van Achter - First Learn The Rules. Then Break ThemDamien Van Achter;L’aide internationale comme arme de contrôle idéologiqueLes États-Unis conditionnent leur aide au rejet de l’égalité de genre et de la diversité, forçant les pays vulnérables à choisir entre santé publique et souveraineté.Damien Van Achter - First Learn The Rules. Then Break ThemDamien Van Achter;Moltbook révèle l’envers du décor de l’économie des agents IAEn 5 jours, un réseau social réservé aux agents IA atteint 1,5 million d’utilisateurs. Mais derrière les paillettes, des failles béantes qui exposent données et infrastructure.Damien Van Achter - First Learn The Rules. Then Break ThemDamien Van Achter;L’argent sale transforme les démocraties en marchandises négociablesL’enquête de Democracy for Sale révèle comment l’argent criminel contourne les systèmes de régulation pour acheter l’influence politique mondiale, du blanchiment par crypto aux grâces présidentielles payantes.Damien Van Achter - First Learn The Rules. Then Break ThemDamien Van Achter;Fico démantèle la protection des lanceurs d’alerte malgré BruxellesLa Commission européenne lance une procédure contre la Slovaquie pour avoir supprimé son bureau de protection des lanceurs d’alerte et l’avoir remplacé par une institution politiquement nommée.Damien Van Achter - First Learn The Rules. Then Break ThemDamien Van Achter;Entretien RFI : Comment expliquer ce qu’est un algorithme ?Thomas Bourdeau (RFI) m’a invité à décrypter ce qu’est réellement un algorithme et pourquoi c’est devenu un enjeu national, dans le contexte des perquisitions chez X et de la convocation d’Elon Musk au parquet de Paris.Damien Van Achter - First Learn The Rules. Then Break ThemDamien Van Achter;Voir cette publication sur Instagram;Une publication partagée par Damien Van Achter (@davanac);sur le site;LinkedIn;Twitter;Mastodon;Facebook;Discord;à mon agenda;les autres éditions de cette newsletter;@davanac"}