{"title":"FLTR #8 : La guerre de l'info à l'échelle industrielle","path":"/fltr-8-la-guerre-de-linfo-a-lechelle-industrielle/","site":"https://da.van.ac","atUri":"at://did:plc:yc5bdaprlbzruqnilm5zvqob/site.standard.document/3mew4jgpop3i2","publishedAt":"2026-02-15T18:00:42Z","tags":"Financial Times;avec plusieurs d'entre elles;« cultiver la résistance » en Europe;La sous-secrétaire de Trump, Sarah Rogers, accuse l’Union d’avoir créé un «appareil de censure»Présente hier, lundi 9 février, à Budapest pour un événement organisé par un think-tank hongrois proche de Viktor Orbán, la sous-secrétaire d’État américaine à la diplomatie publique et aux affaires publiques, Sarah B. Rogers, s’est attaquée à la législation européenne sur les services numériques. Tout en comparant le règlement à un outil de censure semblable à ceux utilisés par le Parti communiste chinois, elle a affirmé vouloir œuvrer à « consolider les racines civilisationnelles communes des États-Unis et de l’Europe » — notamment en portant au pouvoir des partis alignés sur la politique MAGA de la Maison-Blanche.Le Grand ContinentMarin Saillofest;Damien Van Achter;Depuis 2005;J'explique ici;abonner en 1 clic;à mon agenda;enquête sur les « experts » cités dans la presse britannique;plus de 50 personnages fictifs;l'enquête initiale de Press Gazette sur ces réseaux de faux profils;10% d’experts fictifs dans la presse britannique : l’infiltration IAPress Gazette révèle que 10% des experts cités dans les médias britanniques n’existent pas : des personnages générés par IA qui servent de porte-parole factices à des marques via des opérations de relations publiques sophistiquées.Damien Van Achter - First Learn The Rules. Then Break ThemDamien Van Achter;a admis qu'elle était un « pseudonyme éditorial »;This Is What It Looks Like When Nothing MattersWelcome to the internet’s nihilism crisis.The AtlanticCharlie Warzel;« crise du nihilisme numérique »;Aidan Walker, chercheur en culture numérique;Répression migratoire : les médias locaux deviennent refuges informationnelsLes actions ICE génèrent un afflux massif de lecteurs vers les médias locaux non-lucratifs qui couvrent les communautés immigrées, créant un écosystème informationnel de résistance.Damien Van Achter - First Learn The Rules. Then Break ThemDamien Van Achter;4,4 millions d'images générées par Grok en neuf jours;l'équipe de sécurité de xAI se vide de ses cadres;⚡ Et maintenant ?Retrouvez toutes les pistes d’action publiées dans nos articles. Filtrez selon vos moyens, votre contexte, vos ambitions - et passez à l’action.Damien Van Achter - First Learn The Rules. Then Break ThemDamien Van Achter;Réseaux sociaux : le serpent numérique qui dévore la démocratieL’infrastructure des plateformes sociales facilite désormais l’extraction économique et politique massive via des contenus synthétiques. Le modèle publicitaire transforme les escroqueries en revenus légitimes.Damien Van Achter - First Learn The Rules. Then Break ThemDamien Van Achter;Quand la publicité native dévore l’authenticité des réseaux sociauxEnquête sur l’industrialisation du faux contenu organique : des dizaines de créateurs payés génèrent des milliards de vues en faisant passer de la pub pour des témoignages authentiques.Damien Van Achter - First Learn The Rules. Then Break ThemDamien Van Achter;OpenAI co-finance 100 journalistes : réveil tardif ou stratégie d’influenceAprès avoir qualifié le journalisme de ‘relique’, OpenAI finance avec Axios 100 journalistes locaux pour alimenter ChatGPT en infos validées.Damien Van Achter - First Learn The Rules. Then Break ThemDamien Van Achter;Qui surveille les surveillants quand ils viennent du privé ?L’administration Trump place d’anciens dirigeants d’entreprises à la tête de l’organisme censé auditer ces mêmes entreprises, créant un conflit d’intérêts institutionnel.Damien Van Achter - First Learn The Rules. Then Break ThemDamien Van Achter;Plus d’audience, moins de pouvoir : le paradoxe des créateurs numériquesL’analyse d’Axel Springer révèle le paradoxe central du numérique : les créateurs touchent plus de monde mais ont perdu leur pouvoir de négociation face aux plateformes qui contrôlent désormais la visibilité, les prix et la monétisation.Damien Van Achter - First Learn The Rules. Then Break ThemDamien Van Achter;L’extrême droite européenne réclame ses propres unités de déportationAfD bavaroise, Vlaams Belang et Reconquête veulent créer des unités policières spécialisées dans la traque aux migrants, sur le modèle d’ICE américain.Damien Van Achter - First Learn The Rules. Then Break ThemDamien Van Achter;L’Europe inverse le rapport de force technologique avec ses machines à pucesLes dirigeants européens revendiquent leurs dépendances technologiques inverses, particulièrement les machines ASML dont le monde entier a besoin pour produire des puces.Damien Van Achter - First Learn The Rules. Then Break ThemDamien Van Achter;m'avoir donné la parole;Interview LeVif: Microsoft et Google mis hors ligne en Europe? Pourquoi cela n’a plus rien de farfeluMerci à Denoël Thierry et Le Vif de m’avoir donné la parole sur le sujet de notre dépendance technologique vis-à-vis des Big Tech américaines — et sur les alternatives qui existent déjà.Damien Van Achter - First Learn The Rules. Then Break ThemDamien Van Achter;sur le site;LinkedIn;Twitter;Mastodon;Facebook;Discord;à mon agenda;les autres éditions de cette newsletter;@davanac"}