{"title":"October Newsletter 2025","path":"/october-newsletter-2025-2/","site":"https://townsvillebushwalkingclub.com","atUri":"at://did:plc:xkhw46yoqa3kt3nx4s7gtvof/site.standard.document/3mf6oz4bmpqr2","publishedAt":"2026-02-19T03:53:06Z","tags":"DCK Hut Long Weekend - Trip ReportEscape the heat of Townsville and retreat into Paluma Range National Park. A long weekend at DCK Hut meant rainforest hikes, icy creek swims, orchids in bloom, and nights by the fire. Adventure, wildlife, and waterfalls — classic North Queensland bushwalking at its best.Townsville Bushwalking ClubTownsville Bushwalking Club;Castle Hill WWII relics loop - Trip ReportExplore Castle Hill’s hidden WWII relics & bunkers on this 8 km loop in Townsville. From ammo bunkers and searchlight sites to quarry ruins and stone fortifications, this moderate hike combines history, off-track adventure, and sweeping views—perfect for fit walkers seeking heritage and exploration.Townsville Bushwalking ClubTownsville Bushwalking Club;Terraces turns North - Trip ReportNorth Creek bushwalk, Bowling Green Bay National Park. Off-track exploring, rock-hopping, scrambling, wildlife encounters, and a refreshing swim at the waterfall. A stunning day with great company, pristine creeks, and historic North Queensland scenery.Townsville Bushwalking ClubTownsville Bushwalking Club;Alligator Creek Falls - Trip ReportA fun day out at Alligator Creek Falls! Eleven hikers enjoyed bush tracks, two chilly river crossings, and the breathtaking waterfall. Some braved a swim while others relaxed on the rocks. Laughter, photos, and shared snacks made the return walk just as memorable.Townsville Bushwalking ClubTownsville Bushwalking Club;White Rock Bay - Trip ReportA small group explored the rarely visited western side of Cape Cleveland, with 4x4 thrills, sandy coast walks, mangrove sounds, sea eagles, rock scrambles, and a shady dune lunch before uncovering relics and tamarind treats.Townsville Bushwalking ClubTownsville Bushwalking Club;Hermit Falls - Trip ReportNine walkers tackled Hermit Falls the hard way, navigating thick bush, creek crossings, snakes, and scrub bashing before enjoying a chilly swim and the falls’ best views, finishing with the classic Frosty Mango stop.Townsville Bushwalking ClubTownsville Bushwalking Club;**Tully Gorge Challenge**;**The Terraces**;**Blue Gum Circuit, Paluma**;townsvillebushwalkingclub.com"}