{"title":"Edition no. 36","path":"/edition-no-36/","site":"https://ielaw.news","atUri":"at://did:plc:brbfxknpinpcv53otqnq7pxe/site.standard.document/3mee7amzsfzv2","publishedAt":"2026-02-08T15:00:44Z","tags":"Please subscribe;Defense attorney Farooqi joins SB bench as nation's first Pakistan-born judicial officer;Read the speeches from her swearing in ceremony;San Bernardino man testifies in D.C. about shooting by federal agents;See his testimony;The Declaration: He has refused elections;Independence was about soldiers' rations?;$42;ABOTA Speaks Podcast;CAOC Conversations;Texan sues California doctor under new Texas law allowing lawsuits over abortion pills;Read it here;California sues websites that publish blueprints for 3D printer ghost guns;Rob Bonta;multiple state laws;Read it here;These California trucking schools broke state laws. Regulators couldn’t do anything about it;Read it here;Two men charged with assaulting agents in ICE shooting released by a judge, re-detained by ICE;ordered;Read it here;US Senate Republicans block attempt to sue Trump administration over Epstein files;resolution;Read it here;Read the Don Lemon indictment;Section 241 of Title 18: conspiracy against rights;Read the indictment;6 Turpin children to split $13.5M settlement over placement with abusive Riverside County foster parentsRiverside County will pay $2.25 million, while foster family agency ChildNet agreed to pay $11.25 million, the settlement agreement states.Press EnterpriseBrian Rokos;He died in a jail cell, pleading for help. No one told his father whyFive years after Jamall Brown died in a Riverside County California jail cell, his father learned the truth from leaked video and documents.USA TODAY, USA TODAY;Leader of Hemet-based religious group struck congregant with microphone for disobedience, woman testifies at hearing in double-murder caseWoman said Shelley ‘Kat’ Martin, charged with murder along with 4 others, grew more controlling and violent as head of His Way Spirit Led Assemblies.Press Enterprisegqlshare;Jury finds Uber liable in driver rape lawsuit, awards $8.5 million to passengerA federal jury in Phoenix ordered Uber to pay $8.5 million to a passenger who said she was raped by her driver, finding the company liable under an “apparent agency” theory.San Francisco ChronicleAidin Vaziri;Supreme Court allows California to use congressional map benefitting DemocratsThe Supreme Court on Wednesday afternoon cleared the way for California to use a new congressional map intended to give Democrats five additional seats in the U.S. House of Representatives. […]SCOTUSblogAmy Howe;…]SCOTUSblogAmy Howe[Appeals court overturns former UCLA gynecologist’s sex abuse convictionA California appeals court has overturned the conviction of a former campus gynecologist at the University of California, Los Angeles, on sex abuse charges. Dr.AP NewsUpdated [hour]:[minute] [AMPM] [timezone], [monthFull] [day], [year];Appeals court overturns former UCLA gynecologist’s sex abuse convictionA California appeals court has overturned the conviction of a former campus gynecologist at the University of California, Los Angeles, on sex abuse charges. Dr.AP NewsUpdated [hour]:[minute] [AMPM] [timezone], [monthFull] [day], [year][California Attorney General Rob Bonta sues Rady Children’s Health for dropping gender-affirming careCalifornia Attorney General Rob Bonta filed a lawsuit against Rady Children’s Health on Friday for shuttering its gender-affirming care program for patients under the age of 19.NBC San DiegoRenee Schmiedeberg, Christina Bravo"}