{"title":"No. 37","path":"/no-37/","site":"https://ielaw.news","atUri":"at://did:plc:brbfxknpinpcv53otqnq7pxe/site.standard.document/3mevshp6nqpv2","publishedAt":"2026-02-15T15:00:26Z","tags":"Please subscribe;2014 Temecula murder conviction reversed over Miranda rights;Read it here;Covert Chinese agent in Chino Hills gets 4 years;Read it here;The Declaration: He has discouraged immigration;__Hamburg__;__Harper's Weekly__;Independence was over immigration law;the Internet Archive;$57.50 through your local bookshop;the Supreme Court's website;Judge rules on CA’s mask ban for law enforcement;In her ruling;Scott Wiener;Read it here;Trump scraps a cornerstone climate finding, as California prepares for court;Read it here;California sues as Trump cuts $600M in public health grants to four states;filed a joint lawsuit;fund workforce and data modernization;Read it here;Trump administration losing credibility with judges and grand juries – a former federal judge explains why this is ‘remarkable and unprecedented’;grand jury in Washington on Feb. 10, 2026, rebuffed;unprecedented video in November 2025;guilty of sedition, which is punishable by death;latest in an unprecedented string of losses;Dickinson College President John E. Jones III;Read it here;Members of Congress again challenge Noem policy limiting visits to immigration facilities;third;Read it here;The Washington Post;Dickens Festival Turns Focus to Social Justice With Oliver Twist ThemeThe 33rd annual Riverside Dickens Festival will explore themes of poverty, resilience and community care when it returns to White Park Feb. 21-22, marking a shift toward social equity.The Raincross GazetteGazette Staff;Huck Children’s Literature Festival returns March 6Loren Long, Lisa Yee, Jason Chin and Nikki Grimes lead the March 6–7 event at the University of Redlands.Community Forward Redlands NewsSiw Heede;RUSD Board Faces Criticism Over Viral Video, Clause In New ICE-Related PolicyA week after a video posted online showed a principal confronting two student protesters, more than a dozen community members demanded RUSD trustees take action to better protect the free speech rights of students and create stronger immigration enforcement policies.The Riverside RecordDaniel Eduardo Hernandez;Redlands police weekly update: DUI arrests, burglary spree, drug casesRedlands Police Weekly Update: Feb. 5 - 12Community Forward Redlands NewsCommunity Forward Redlands;California man serving prison time is awarded $27.3 million for 2021 shooting by deputyA federal jury awarded more than $27 million in damages to an Adelanto man who now uses a wheelchair after being shot multiple times by a San Bernardino County sheriff’s deputy in 2021.Los Angeles TimesFollow;Opinion | Good behavior musn’t determine if a California prison inmate lives in a safe environmentAn incarcerated person’s constitutional right to a safe and healthy environment in a single occupancy cell cannot be withheld on the condition that she or he be good.CalMattersGuest Commentary;Opinion | Tax dollars should fund children’s education, not attorneys’ fees in child sex abuse casesCalifornia school districts could be on the hook for about $3 billion in liability for child sexual abuse lawsuits. Up to 40% may go to trial attorneys.CalMattersGuest Commentary;Opinion | Will California lawmakers break their promise to child sexual abuse survivors?In 2019, the Legislature and Gov. Newsom closed a loophole that allowed schools to avoid liability for child sexual abuse. Now the law is under threat.CalMattersGuest Commentary;Rady Children’s to continue providing gender-affirming care, judge rulesAfter Rady announced last month that it would no longer offer surgeries and other treatments such as puberty blockers, the California Attorney General’s Office sued the provider, alleging that it was ending services unlawfully.KPBSCity News Service;Lawyers of Chicago woman shot by federal agents say documents show how DHS lies about investigationsAttorneys for a woman shot multiple times by a Border Patrol agent last year in Chicago say newly-released videos, texts and emails show how the Trump administration mishandles investigations and spreads misinformation.AP NewsSOPHIA TAREEN;US antitrust chief Gail Slater ousted from Trump justice departmentExclusive: Decision comes after Slater lost the support of JD Vance and Pam Bondi, the attorney generalThe GuardianHugo Lowell;Trump case against BBC to go to trial in February 2027Donald Trump’s multi-billion dollar lawsuit against the BBC is set to go to trial in February 2027.BBC News"}