{"title":"Your Doorbell Almost Became a Police Informant: How Public Outrage Killed the Ring-Flock Surveillance Partnership","path":"/your-doorbell-almost-became-a-police-informant-how-public-outrage-killed-the-ring-flock-surveillance-partnership/","site":"https://www.secureiot.house","atUri":"at://did:plc:rvmw6j2dwcsa2mybqgdbxwis/site.standard.document/3meuq6ctz2fc2","publishedAt":"2026-02-15T04:47:09Z","tags":"blog post;The Doorbell Surveillance State: A Technical and Statistical Analysis of Smart Doorbells, Law Enforcement Partnerships, and the 67 Million Daily Strangers at Your DoorAn estimated 60+ million packages arrive at American doorsteps every single day. Over a third of those homes now have a camera pointed at whoever drops them off. Here’s what the numbers actually tell us about the largest distributed surveillance network ever built — and who really controls the footage. ExecutiveSecure IoT HouseSecure IoT House;announced in October 2025;404 Media;publicly denied;called Search Party;open letter to Amazon;Your Smart Doorbell Is Watching More Than You Think: The Privacy Nightmare of Always-On Home DevicesThe camera protecting your front porch might be the biggest threat to your privacy inside your home. Here’s a number that should keep you up at night: 87% of Americans have no idea how their doorbell camera data is being used. That statistic, from The Zebra’s 2024 consumer survey, meansSecure IoT HouseSecure IoT House;over 400 law enforcement agencies;criticized the program;tormented children;Faces stored;multiple security breaches;caught uploading footage to the cloud;accessed by ICE;paused;“Deleted” Doesn’t Mean Gone: The Nancy Guthrie Case Just Exposed the Uncomfortable Truth About Your Smart CameraThe FBI recovered Google Nest footage that shouldn’t have existed. Here’s what that means for every smart camera owner who thought their data was private. On February 1, 2026, 84-year-old Nancy Guthrie — the mother of NBC’s “Today” co-anchor Savannah Guthrie — was abducted from her home in Tucson, Arizona. When investigatorsSecure IoT HouseSecure IoT House;mixed at best;Ring Privacy & Security Settings;Opt Out of Video Requests;Electronic Frontier Foundation;ACLU Technology & Liberty Project;Surveillance Technology Oversight Project (STOP);HomeKit Secure Video Guide;Ubiquiti UniFi Protect;Frigate NVR (Open Source);ACLU Community Control Over Police Surveillance (CCOPS);Fight for the Future: Ban Facial Recognition"}