{"title":"St. Chad's Church, Prees","path":"/st-chads-church/","site":"https://magcek.com","atUri":"at://did:plc:btp3legpfekkvgvpc5cuhn4f/site.standard.document/3mf2es3hj74g2","publishedAt":"2026-01-27T17:49:26Z","tags":"Prees - St Chad’s ChurchThe historic and beautiful Church of St Chad’s is largely 14th-century but is built on a Saxon site; it has an 18th-century tower and contains a notable window made up of fragments of medieval glass brought to Prees from the site of the Battle of Shrewsbury, 1403. The church is Grade 2* listed. St Chad’s is part of the PEW group of churches in North Shropshire - working together with St Chad’s Prees and St Mary the Virgin Edstaston. We are delighted to say that our new Vicar, Revd Mark Amey, will be in post from 17 February. ................... We are occasionally live streaming some of our services on Facebook (http://www.facebook.com/pewchurches), uploading them afterwards on our YouTube channel https://www.youtube.com/channel/UCZh4Q1jD0dFPNwMTJ86UtmA) but most services are now ‘in-person’. THE COMING WEEKS IN PEW: All the following are joint services for the whole benefice and all are welcome! Sunday 18 January 11.00am: Week of Christian Unity: Family Worship: St Chad’s Church, Prees (10.45 for crafts and refreshments; service starts at 11.00) Sunday 25 January 11.00am: Conversion of St Paul: Holy Communion St Mary’s, Whixall Sunday 1 February 11.00am: Candlemas: Holy Communion: St Chad’s Church, Prees Sunday 8 February 11.00am: Holy Communion: St Mary the Virgin Edstaston Sunday 15 February 11.00am: Family Worship: St Chad’s Church, Prees (10.45 for crafts and refreshments; service starts at 11.00) Tuesday 17 February 7pm: The Service of Institution of Revd Mark Amey as Vicar of the PEW Benefice: St Chad’s Church, Prees If you wish to book a wedding or baptism, please email enquiries to pewchurches@gmail.com and we will get right back to you! +++++++++ The Church and churchyard, vicarage and school are nestled together by the War Memorial and garden on the edge of the village of Prees and form a picturesque area within the village. The parish of St Chad’s Church covers the villages of Prees, Higher Heath and Prees Green as well as some surrounding farms and cottages. There are 35 on the electoral roll. There is an enthusiastic team of bell ringers, who ring most Sundays and for weddings, and worship is enriched by a wonderful organ, which is kept in good repair. Services vary from week to week, in a regular pattern, offering opportunities for varied worshiping styles. In normal times services are followed by tea, coffee and biscuits, giving the congregation time to meet and get to know one another. These times have proved invaluable in achieving a sense of oneness in the congregation and an opportunity to welcome visitors in a relaxed way. Social activities are organised throughout the year, not just to raise money but to allow the community to meet together and usually eat together! Prees congregation members also offer a Self Support in Bereavement Group which meet monthly for outings and company, and St Chad’s Ladies also meet monthly for friendship and outings. The PCC has a 100 Club to raise money for the upkeep of the churchyard and Church building, which is appreciated as an asset in the whole community. The response has been encouraging and assures us that people appreciate and support ‘their’ church, even though they may not be regular worshippers. The parish of Prees: St Chad is committed to the safeguarding of children, young people and adults. We follow the House of Bishops’ guidance and policies and have our own Parish Safeguarding Officer: B.Hodges: 01948 840644. The Diocese of Lichfield’s safeguarding pages contain vital links and information including contacts for the Diocesan Safeguarding Advisor (DSA) who advise our PSOs. If you are concerned that a child or adult has been harmed or may be at risk of harm please contact the DSA: 01543 221105 or 01543 306147 during office hours or 030 3003 1111 opt2 for weekend and out of hours. If you have immediate concerns about the safety of someone, please contact the police Protecting Vulnerable People (West Mercia Police): 0300 333 3000 and your local authority Children or Adults Services: 0345 678 9021: out of hours: 0345 678 9040Prees - St Chad's Church"}