{"title":"Inside China's Cyber War Rehearsals: Leaked Documents Reveal Critical Infrastructure Attack Training","path":"/inside-chinas-cyber-war-rehearsals-leaked-documents-reveal-critical-infrastructure-attack-training/","site":"https://breached.company","atUri":"at://did:plc:qdahbg4ooaomi3fgwc5eiy7h/site.standard.document/3mf5ovp354z32","publishedAt":"2026-02-18T18:17:46Z","tags":"Poland’s Winter Power Grid Attack: Sandworm’s DynoWiper Targets 30 Facilities in Coordinated Critical Infrastructure AssaultIn the depths of a Polish winter, Russian military intelligence orchestrated one of the most significant cyberattacks on European critical infrastructure in a decade. On December 29-30, 2025, approximately 30 distributed energy facilities across Poland fell victim to a coordinated wiper malware campaign attributed to Sandworm (also known as ELECTRUM)Breached CompanyBreached Company;Salt Typhoon Expands to Norway: China’s Telecom Hackers Are Now a Global ThreatA Nation-State APT That Breached 9 US Carriers Is Operating in Allied Nations. Here’s What Your Organization Needs to Know—and Do—Right Now. Executive Summary: This Is Not Just Norway’s Problem On February 6, 2026, Norway’s Police Security Service (PST) publicly confirmed what security professionals have feared: Salt Typhoon—Breached CompanyBreached Company;Salt Typhoon Strikes Congress: Chinese APT Breaches Email Systems of Key House CommitteesBreaking cybersecurity analysis of the latest congressional intrusion by China’s Ministry of State Security Executive Summary In what marks a significant escalation of Chinese cyber espionage operations, threat actors linked to China’s Ministry of State Security (MSS) successfully compromised email systems used by staff members of multiple powerful U.S.Breached CompanyBreached Company;Salt Typhoon: Chinese Hackers Expand Beyond Telecom to Target Critical US Data InfrastructureHow Chinese state-sponsored hackers penetrated America’s telecommunications backbone and expanded into data centers, exposing the vulnerabilities in our most critical digital infrastructure China’s Cyber Campaigns: A Deep Dive into Salt & Volt Typhoon and Other Threat ActorsIn recent years, cyber espionage has become a significant concern, with nation-state actors employingBreached CompanyBreached Company;FBI Veteran Reveals Salt Typhoon Monitored Every American for Five Years: The Unprecedented Scale of Chinese Cyber EspionageBottom Line Up Front: Former FBI cyber official Cynthia Kaiser has claimed that it’s nearly impossible to envision any American who wasn’t impacted by the Salt Typhoon cyberattack—a five-year Chinese state-sponsored campaign that had “full reign access” to U.S. telecommunications data, monitoring phone calls, text messages, and movementsBreached CompanyBreached Company;Chinese state-sponsored Espionage Group Silk Typhoon Targets IT Supply ChainMicrosoft has identified a significant shift in tactics by the Chinese state-sponsored espionage group Silk Typhoon (also tracked as HAFNIUM), which now targets IT supply chains and cloud applications to breach downstream organizations14. This technical brief outlines their evolving tradecraft, historical patterns, and mitigation strategies. Executive Summary Silk Typhoon hasBreached CompanyBreached Company;Volt Typhoon Hacking GroupVolt Typhoon is a relatively lesser-known entity in the vast and murky world of cyber threats, yet its activities have caught the attention of cybersecurity experts and organizations due to their sophisticated and targeted nature. This hacking group has been attributed to a series of cyber espionage campaigns primarily targetingBreached CompanyBreached Company"}