{"title":"Third Time's a Pattern: Panera Bread's Decade of Data Disasters","path":"/third-times-a-pattern-panera-breads-decade-of-data-disasters/","site":"https://breached.company","atUri":"at://did:plc:qdahbg4ooaomi3fgwc5eiy7h/site.standard.document/3mf5nvxqu47x2","publishedAt":"2026-02-18T18:00:39Z","tags":"ShinyHunters Triple Strike: How Okta Impersonators Breached Crunchbase, SoundCloud, and BettermentA coordinated social engineering campaign targeting single sign-on credentials demonstrates that the human factor remains cybersecurity’s weakest link Executive Summary In January 2026, the notorious ShinyHunters cybercrime group executed a sophisticated social engineering campaign that breached three major technology platforms—Crunchbase, SoundCloud, and Betterment—by impersonating Okta cybersecurity employees. TheBreached CompanyBreached Company;ShinyHunters: The Evolution of a Cybercrime Empire - From Pokémon-Inspired Hackers to Global ThreatBottom Line: ShinyHunters emerged in 2020 as a data theft collective that has stolen information from over 1 billion users across hundreds of companies. From their early days selling databases for profit to their current sophisticated voice phishing campaigns targeting Salesforce instances, they’ve evolved from opportunistic hackers into one ofBreached CompanyBreached Company;Salesforce-Gainsight Breach: ShinyHunters Strike Again with Third-Party Attack Affecting 200+ CompaniesExecutive Summary: Salesforce has disclosed yet another major security incident affecting customer data, this time involving compromised Gainsight applications. The breach, attributed to the notorious ShinyHunters cybercrime collective, has impacted over 200 Salesforce instances and represents the latest chapter in a devastating year of supply chain attacks that have exposedBreached CompanyBreached Company;AT&T Breach Data Resurfaces in 2026: Why “Old” Breaches Become MORE Dangerous Over TimeWhen your stolen data comes back from the dead, it doesn’t return weaker—it returns with reinforcements. The Zombie Data Problem You might think that a data breach from 2019 would be old news by now. Outdated. Stale. Maybe even useless to criminals who have surely moved on to fresherBreached CompanyBreached Company;PornHub Faces Extortion After ShinyHunters Steals 200 Million Premium Member Records in Mixpanel BreachThe adult entertainment platform PornHub is being extorted by the notorious ShinyHunters hacking group following the theft of over 200 million Premium member activity records. The breach, which both parties attribute to a recent compromise at analytics provider Mixpanel, has exposed highly sensitive user data including detailed viewing histories, searchBreached CompanyBreached Company;When Billionaires Become the Breach: Inside the ShinyHunters Attack on Harvard’s Donor DatabaseA comprehensive analysis of how voice phishing led to one of higher education’s most consequential data exposures—and why 115,000 affected individuals may never be officially notified. The Attack That Exposed America’s Wealthiest Donors On February 4, 2026, the cybercriminal syndicate ShinyHunters made good on a threat that hadBreached CompanyBreached Company;haveibeenpwned.com;Equifax;Experian;TransUnion;The Gmail Security Crisis: 2.5 Billion Users at Risk After ShinyHunters BreachBottom Line: Google has confirmed that hackers breached its Salesforce database in June 2025, exposing business contact information for 2.5 billion Gmail users. While passwords weren’t stolen, cybercriminals are now using this data to launch sophisticated voice phishing campaigns targeting user accounts. Gmail users must immediately enable two-factor authenticationBreached CompanyBreached Company"}