{"title":"Darkness, democracy, and locking it down","path":"/darkness-democracy-and-locking-it-down-2/","site":"https://www.404media.co","atUri":"at://did:plc:opaexgne3jdkt4bjsftn443k/site.standard.document/3me7k5ogqv4k2","publishedAt":"2026-02-06T18:33:33Z","tags":"_On the podcast this week_;_And in this week’s interview_;@404.media;♬ original sound - 404 Media;_Apple Podcasts_;_Spotify_;_YouTube_;_and get it here_;_unable to access a Washington Post reporter’s seized iPhone_;_left multiple unredacted photos of fully nude women or girls exposed_;_vibe coding is killing open-source software (OSS)_;Daniil Komov;Unsplash;_What we’re seeing, though, is not a mistake_;_Musk to Epstein: ‘What Day/Night Will Be the Wildest Party on Your Island?’_;_Exposed Moltbook Database Let Anyone Take Control of Any AI Agent on the Site_;_Privacy Telecom ‘Cape’ Introduces ‘Disappearing Call Logs’ That Delete Every 24 Hours_;_Wedding Photo Booth Company Exposes Customers’ Drunken Photos_;_Hackers and Trolls Target Wave of ICE Spotting Apps_;_Scientists Keep Discovering Mysterious Ancient Tunnels Across Euro_;_This Tool Searches the Epstein Files For Your LinkedIn Contacts_;_This SpaceX Situation: Not Good!_;_The DOJ Redacted a Photo of the Mona Lisa in the Epstein Files_;Inspector General Investigating Whether ICE's Surveillance Tech Breaks the Law;Science Friday to talk about deepfakes;discussing it there;\"AI: The Death of the Internet\";joined John Stewart;PBS News Hour;contact us;_DOJ Released Unredacted Nude Images in Epstein Files_;_Our Zine About ICE Surveillance Is Here_;_with your support_;_Behind the Blog_;_been unable to get into a Washington Post reporter’s iPhone_;_cat and mouse dynamic_;_Grayshift then said_;_possibility of not getting a warrant_;_Cellebrite and_;_Graykey related leaks_;FBI Couldn’t Get into WaPo Reporter’s iPhone Because It Had Lockdown Mode EnabledLockdown Mode is a sometimes overlooked feature of Apple devices that broadly make them harder to hack. A court record indicates the feature might be effective at stopping third parties unlocking someone’s device. At least for now.Joseph Cox;_we revealed in 2024_;Cellebrite Unlocked This Journalist’s Phone. Cops Then Infected it With MalwareA new report from Amnesty International reveals multiple cases where Serbian authorities used Cellebrite devices to access targets’ mobile phones before loading them with spyware.Joseph Cox;_They are abused_;_Moltbook_;Exposed Moltbook Database Let Anyone Take Control of Any AI Agent on the Site‘It exploded before anyone thought to check whether the database was properly secured.’Matthew Gault;_numerous studies_;including faces and full names,;The DOJ Redacted a Photo of the Mona Lisa in the Epstein FilesWhile Epstein’s victims endure the fallout of their photos and names being exposed in the Department of Justice’s latest tranche of files, investigators redacted a photo of the Mona Lisa. Now we know why.Samantha Cole;podcast this week;@Evy"}